<template>
  <div class="page-wrapper">
    <section class="support">
      <div class="support__wrapper container">
        <div class="support__header">
          <h4 class="support__name">
            {{ measure.name }}
          </h4>
          <div class="support__details">
            <div class="support__date">
              Приём заявок<br />
              <b>{{ measurePeriod() }}</b>
            </div>
            <div class="support__manual">
              <button class="support__manual__button btn btn-outline-primary">
                Как подать заявку?
              </button>
            </div>
          </div>
        </div>

        <hr />

        <div class="support__card">
          <div class="support__card__header row">
            <div class="support__owner col-md-6 col-xl-4">
              <div class="support__owner__header">Инициатор</div>
              <div class="support__owner__logo">
                <img
                  class="org-logo"
                  src="images/initiators_logo/mshlogo.png"
                  alt=""
                />
                <div class="support__owner__name">
                  Министерство сельского хозяйства
                </div>
              </div>
            </div>
            <div class="support__conditions col-12 col-md-6 col-xl-5">
              <div class="support__conditions__header">Размер поддержки</div>
              <div class="support__size">до 20 000 000 рублей</div>
              <div class="support__size__info"></div>
            </div>
            <div class="support__buttons col">
              <img
                class="support__icon"
                src="@/assets/electronic.png"
                title="По данной мере поддержки есть возможность электронной подачи"
                alt=""
              />
              <b-button v-b-modal.measure-application-form>
                Подать заявку
              </b-button>
            </div>
          </div>

          <hr />

          <b-card no-body>
            <b-tabs pills card vertical nav-wrapper-class="col-12 col-md-4">
              <b-tab title="Описание" active>
                <b-card-text>
                  <h3>Описание</h3>
                  <p>{{ measure.description }}</p>
                  <hr />
                  <p>
                    Субсидии в сельском хозяйстве на возмещение части затрат
                    предоставляются министерством сельского хозяйства, до
                    которого в соответствии с бюджетным законодательством
                    Российской Федерации как до получателя бюджетных средств
                    доведены в установленном порядке лимиты бюджетных
                    обязательств на предоставление субсидий на соответствующий
                    финансовый год и плановый период на компенсацию части
                    затрат, понесенных в текущем финансовом году (возмещение
                    части затрат на закупку сельскохозяйственной продукции, с
                    целью развития на сельских территориях региона сельского
                    хозяйства.
                  </p>
                  <p>Субсидия предоставляется при соблюдении условий:</p>
                  <ul>
                    <li>
                      получатели субсидий - юридические лица не находится в
                      процессе реорганизации, ликвидации, в отношении него не
                      введена процедура банкротства, деятельность получателя не
                      приостановлена;
                    </li>
                    <li>
                      получатели субсидий – индивидуальные предприниматели не
                      прекратили деятельность в качестве индивидуального
                      предпринимателя, а также в отношении их не введена
                      процедура банкротства;
                    </li>
                    <li>
                      государственной регистрации или постановки на учет в
                      налоговом органе получателей субсидий;
                    </li>
                    <li>
                      отсутствии у получателей субсидий неисполненной
                      обязанности по уплате налогов, сборов, страховых взносов,
                      пеней, штрафов, процентов, подлежащих уплате в
                      соответствии с законодательством Российской Федерации о
                      налогах и сборах;
                    </li>
                    <li>
                      отсутствия просроченной задолженности по возврату в
                      областной бюджет субсидий, бюджетных инвестиций и иной
                      просроченной (неурегулированной) задолженности по денежным
                      обязательствам;
                    </li>
                    <li>
                      получатели субсидий не являются иностранными юридическими
                      лицами, а также российскими юридическими лицами, в
                      уставном (складочном) капитале которых доля участия
                      иностранных юридических лиц, местом регистрации которых
                      является государство или территория, включенные в
                      утверждаемый Министерством финансов Российской Федерации
                      перечень государств и территорий, предоставляющих льготный
                      налоговый режим налогообложения и (или) не
                      предусматривающих раскрытия и предоставления информации
                      при проведении финансовых операций (офшорные зоны) в
                      отношении таких юридических лиц, в совокупности превышает
                      50 процентов.
                    </li>
                  </ul>
                </b-card-text>
              </b-tab>
              <b-tab title="Требования к заявителю">
                <b-card-text
                  ><h3>Требования к заявителю</h3>
                  <p>
                    Получателями грантов являются физические лица, занимающиеся
                    научной (научно-исследовательской), научно-технической или
                    инновационной деятельностью научных организациях,
                    образовательных организациях высшего образования, иных
                    организациях, один из видов осуществляемой деятельности
                    которых относится к классу 72 «Научные исследования и
                    разработки» раздела M «Деятельность профессиональная,
                    научная и техническая» Общероссийского классификатора видов
                    экономической деятельности ОК 029-2014 (КДЕС Ред. 2),
                    принятого приказом Федерального агентства по техническому
                    регулированию и метрологии от 31.01.2014 № 14-ст, за
                    исключением государственных (муниципальных) учреждений
                    (далее — организации, осуществляющие научные исследования и
                    разработки), отвечающие требованиям, предусмотренным пунктом
                    2.4 Порядка, и являющиеся на дату подачи заявки на
                    предоставление гранта (далее — заявка):
                  </p>
                  <ul>
                    <li>
                      студентами (курсантами) — лицами, осваивающими
                      образовательные программы бакалавриата, специалитета,
                      магистратуры в возрасте до 30 лет включительно;
                    </li>
                    <li>
                      аспирантами, научными работниками, педагогическими
                      работниками, специалистами (инженерно-техническими
                      работниками) образовательных организаций высшего
                      образования или научных организаций без ученой степени в
                      возрасте до 30 лет включительно;
                    </li>
                    <li>
                      научными работниками, педагогическими работниками,
                      имеющими ученую степень кандидата наук в возрасте до 35
                      лет включительно либо имеющими ученую степень доктора наук
                      в возрасте до 40 лет включительно;
                    </li>
                    <li>
                      специалистами либо руководителями организаций,
                      осуществляющих научные исследования и разработки, в
                      возрасте до 35 лет включительно.
                    </li>
                  </ul>
                  <p>
                    Получатели грантов должны соответствовать на первое число
                    месяца, в котором объявлен конкурс на предоставление гранта,
                    следующим требованиям:
                  </p>
                  <ul>
                    <li>
                      не должны являться получателями средств из бюджета города
                      на цели предоставления гранта, указанные в пункте 1.3
                      Порядка, в течение двух предшествующих лет;
                    </li>
                    <li>
                      не должны иметь просроченную задолженность по возврату в
                      бюджет города субсидий, бюджетных инвестиций, и иную
                      просроченную задолженность перед бюджетом города;
                    </li>
                    <li>
                      не должны иметь неисполненную обязанность по уплате
                      налогов, сборов, страховых взносов, пеней, штрафов и
                      процентов, подлежащих уплате в соответствии с
                      законодательством Российской Федерации о налогах и сборах.
                    </li>
                  </ul>
                </b-card-text>
              </b-tab>
              <b-tab
                title="Необходимые документы для предоставления меры поддержки"
              >
                <b-card-text>
                  <h3>
                    Необходимые документы для предоставления меры поддержки
                  </h3>
                  <p>
                    Для участия в конкурсе соискатель гранта вносит данные о
                    себе в предусмотренные для заполнения поля в Системе и
                    размещает в ней электронные образы следующей конкурсной
                    документации, полученной в результате сканирования
                    документов на бумажных носителях:
                  </p>
                  <ul>
                    <li>
                      заявки по форме согласно приложению 1 к Порядку,
                      согласованной руководителем организации, в которой учится
                      или работает соискатель гранта, и печатью данной
                      организации (при наличии);
                    </li>
                    <li>
                      нотариально заверенного перевода документа,
                      удостоверяющего личность соискателя гранта (в случае если
                      соискатель гранта является иностранным гражданином);
                    </li>
                    <li>
                      ходатайства ученого совета научной или образовательной
                      организации высшего образования, руководителя организации,
                      осуществляющей научные исследования или разработки, в
                      которой учится или работает соискатель гранта, о
                      предоставлении гранта соискателю гранта, включающего в
                      себя описание значимости результатов, полученных в рамках
                      научного проекта, личного вклада соискателя гранта в
                      достижение полученных результатов и согласие на
                      предоставление соискателю гранта условий для выполнения
                      научного проекта по теме гранта;
                    </li>
                    <li>
                      диплома о присуждении соискателю гранта ученой степени
                      либо приказа министерства науки и высшего образования
                      Российской Федерации о выдаче диплома (при наличии);
                    </li>
                    <li>
                      финансовых документов, подтверждающих осуществление
                      затрат, предусмотренных пунктом 1.3 Порядка (в случае
                      подачи заявки в целях возмещения затрат, понесенных в
                      течение 12 месяцев, предшествующих дате подачи заявки);
                    </li>
                    <li>
                      свидетельства о постановке соискателя гранта на учет в
                      налоговом органе;
                    </li>
                    <li>
                      документа, подтверждающего регистрацию в системе
                      индивидуального (персонифицированного) учета, в том числе
                      в форме электронного документа;
                    </li>
                    <li>
                      согласия соискателя гранта на публикацию (размещение) в
                      информационно-телекоммуникационной сети «Интернет»
                      информации о соискателе гранта, информации, содержащейся в
                      заявке соискателя гранта и иной информации, связанной с
                      участием в конкурсе;
                    </li>
                    <li>
                      согласия соискателя гранта и лиц, являющихся поставщиками
                      (подрядчиками, исполнителями) по договорам, заключенным в
                      целях исполнения обязательств по договорам о
                      предоставлении грантов на финансовое обеспечение затрат в
                      связи с производством (реализацией) товаров, выполнением
                      работ, оказанием услуг (за исключением государственных
                      (муниципальных) унитарных предприятий, хозяйственных
                      товариществ и обществ с участием публично-правовых
                      образований в их уставных (складочных) капиталах, а также
                      коммерческих организаций с участием таких товариществ и
                      обществ в их уставных (складочных) капиталах), на
                      осуществление департаментом и органами муниципального
                      финансового контроля проверок соблюдения условий, целей и
                      порядка предоставления гранта;
                    </li>
                    <li>
                      согласия соискателя гранта на обработку департаментом его
                      персональных данных в соответствии с Федеральным законом
                      от 27.07.2006 № 152-ФЗ «О персональных данных».
                    </li>
                  </ul>
                </b-card-text>
              </b-tab>
              <b-tab title="Порядок рассмотрения заявок участников">
                <b-card-text>
                  <h3>Порядок рассмотрения заявок участников</h3>
                  <p>
                    Департамент в течение срока приема заявок осуществляет
                    предварительный анализ заявок соискателей и документов на
                    предмет правильности и полноты их представления и, в случае
                    необходимости уточнения информации, осуществляет подготовку
                    письменного уведомления, направляет его соискателю гранта
                    посредством Системы на адрес электронной почты, указанный в
                    заявке.
                  </p>
                  <p>
                    Предварительный анализ осуществляется только в случае подачи
                    соискателем гранта заявки не позднее чем за 10 дней до даты
                    окончания срока приема заявок (включительно).
                  </p>
                  <p>
                    Соискатель гранта вправе представить скорректированную
                    (уточненную) заявку до даты окончания срока приема заявок
                    (включительно). Непредставление соискателем гранта
                    скорректированной (уточненной) заявки в указанный срок
                    расценивается как отказ от участия в конкурсе.
                  </p>
                  <p>
                    Департамент в течение 15 дней со дня окончания срока приема
                    заявок принимает решение о признании соискателя гранта
                    участником конкурса при отсутствии оснований,
                    предусмотренных пунктом 2.9 Порядка, направляет письма о
                    назначении экспертов.
                  </p>
                  <p>
                    Экспертиза поданных на участие в конкурсе заявок и
                    подготовка экспертного заключения осуществляется экспертами
                    в Системе в течение 14 дней со дня назначения им заявок.
                  </p>
                  <p>
                    Оценка заявок участников конкурса экспертами осуществляется
                    по шкале от 0 до 10 баллов с последующим суммированием
                    баллов по критериям. Итоговое количество баллов определяется
                    как средняя арифметическая сумма баллов, присвоенных каждым
                    экспертом по всем критериям оценки (с округлением до
                    тысячных).
                  </p>
                  <p>
                    Заявка участника конкурса не допускается к рассмотрению на
                    заседании координационного совета при наличии хотя бы одного
                    заключения о несоответствии научного проекта.
                  </p>
                  <p>
                    Департамент в течение пяти дней со дня завершения оценки
                    экспертами последней заявки формирует общий рейтинг
                    участников конкурса.
                  </p>
                  <p>
                    Координационный совет не позднее 20 дней со дня получения
                    доступа к просмотру заявок участников конкурса, экспертным
                    заключениям и общему рейтингу участников рассматривает
                    заявки и принимает решение о признании участников конкурса
                    победителями с указанием размера грантов.
                  </p>
                  <p>
                    Победителями конкурса признаются участники, набравшие
                    наибольшее количество баллов и имеющие наиболее высокие
                    позиции в общем рейтинге. Победителем конкурса не может быть
                    признан участник, заявка которого набрала менее 3 баллов.
                  </p>
                  <p>
                    Координационный совет имеет право принять решение, отличное
                    от мнения экспертов в части количества баллов, набранных
                    участником конкурса, с последующим изменением общего
                    рейтинга, обосновав свое решение в соответствии с критериями
                    оценки, и занесением соответствующей информации в протокол
                    заседания.
                  </p>
                  <p>
                    Протокол заседания координационного совета, содержащий
                    информацию об общем рейтинге участников и победителях
                    конкурса, подписывается председателем и секретарем
                    координационного совета в течение 10 дней с даты проведения
                    заседания координационного совета и направляется в
                    департамент.
                  </p>
                </b-card-text>
              </b-tab>
              <b-tab title="Администратор меры">
                <b-card-text>
                  <h3>Администратор меры</h3>
                  <p>Территориальный уровень меры поддержки: Региональный</p>
                  <p>
                    Название организации: Департамент промышленности, инноваций
                    и предпринимательства
                  </p>
                  <p>
                    Ссылка на сайт администратора меры поддержки:
                    <a href="https://dep.test.ru">https://dep.test.ru/</a>
                  </p>
                  <p>
                    Контактная информация: 200-00-00, e-mail:
                    <a href="mailto:test@test.ru">test@test.ru</a>
                  </p>
                </b-card-text>
              </b-tab>
              <b-tab title="Нормативная правовая база">
                <b-card-text>
                  <h3>Нормативно-правовая база</h3>
                  <p>
                    Конкурс проводится в соответствии с Порядком предоставления
                    грантов в форме субсидий в сфере научной и инновационной
                    деятельности, утвержденным постановлением от 01.01.2021 №
                    200.
                  </p>
                </b-card-text>
              </b-tab>
            </b-tabs>
          </b-card>
        </div>
      </div>
    </section>
    <Loader v-show="loading" />
    <hr />
        <MeasureApplicationForm
          :application-form="startForm.applicationDTO"
        />
  </div>
</template>

<script>
import Loader from "@/components/Loader";
import MeasureApplicationForm from "@/components/MeasureApplicationForm";

export default {
  name: "SubsidyInfoTemp",

  data() {
    return {
      loading: false,
      measure: [],
      measureForms: [],
      startForm: {
        applicationDTO: {
          active: false,
          archive: false,
          data: {},
          endDate: null,
          form: {
            actions: [],
            id: 0,
            modelId: 0,
            name: "",
            scheme: {},
          },
          id: 0,
          orderId: "",
          startDate: "",
          status: "",
          type: 0
        },
      },
      // asd: {
      //   applicationDTO: {
      //     id: 0,
      //     orderId: null,
      //     status: "",
      //     data: "{}",
      //     form: {
      //       id: 49840,
      //       name: "Заявление (черновик)",
      //       scheme: {
      //         components: [
      //           {
      //             extTypeCheckbox: false,
      //             epgu_selected_vs: {},
      //             components: [
      //               {
      //                 extTypeCheckbox: false,
      //                 epgu_selected_vs: {},
      //                 input: false,
      //                 columns: [
      //                   {
      //                     pull: 0,
      //                     components: [
      //                       {
      //                         extTypeCheckbox: false,
      //                         epgu_selected_vs: {},
      //                         input: true,
      //                         dataGridLabel: false,
      //                         hideOnChildrenHidden: false,
      //                         tableView: true,
      //                         smev_req: {},
      //                         require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                         disabled: true,
      //                         label: "Статус заявления",
      //                         type: "textfield",
      //                         key: "params_handler_state_string",
      //                       },
      //                     ],
      //                     offset: 0,
      //                     size: "md",
      //                     width: 6,
      //                     push: 0,
      //                   },
      //                   {
      //                     pull: 0,
      //                     components: [
      //                       {
      //                         extTypeCheckbox: false,
      //                         epgu_selected_vs: {},
      //                         widget: {
      //                           minDate: null,
      //                           enableTime: true,
      //                           format: "dd-MM-yyyy",
      //                           displayInTimezone: "viewer",
      //                           noCalendar: false,
      //                           type: "calendar",
      //                           locale: "ru",
      //                           time_24hr: false,
      //                           allowInput: true,
      //                           minuteIncrement: 1,
      //                           mode: "single",
      //                           useLocaleSettings: false,
      //                           maxDate: null,
      //                           hourIncrement: 1,
      //                         },
      //                         dataGridLabel: false,
      //                         hideOnChildrenHidden: false,
      //                         format: "dd-MM-yyyy",
      //                         tableView: false,
      //                         require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                         label: "Дата подачи заявления",
      //                         type: "datetime",
      //                         input: true,
      //                         smev_req: {},
      //                         disabled: true,
      //                         key: "params_handler_application_start",
      //                       },
      //                     ],
      //                     offset: 0,
      //                     size: "md",
      //                     width: 6,
      //                     push: 0,
      //                   },
      //                 ],
      //                 dataGridLabel: false,
      //                 smev_req: {},
      //                 tableView: false,
      //                 require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                 label: "Столбцы",
      //                 type: "columns",
      //                 key: "columns",
      //                 esiaKey: {},
      //               },
      //               {
      //                 extTypeCheckbox: false,
      //                 epgu_selected_vs: {},
      //                 input: false,
      //                 columns: [
      //                   {
      //                     pull: 0,
      //                     components: [
      //                       {
      //                         extTypeCheckbox: false,
      //                         epgu_selected_vs: {},
      //                         dataGridLabel: false,
      //                         hideOnChildrenHidden: false,
      //                         tableView: true,
      //                         require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                         label: "Номер заявления на ЕПГУ",
      //                         type: "textfield",
      //                         input: true,
      //                         smev_req: {},
      //                         disabled: true,
      //                         placeholder: "Личное обращение",
      //                         key: "Service.orderId",
      //                       },
      //                     ],
      //                     offset: 0,
      //                     size: "md",
      //                     width: 6,
      //                     push: 0,
      //                   },
      //                   {
      //                     pull: 0,
      //                     components: [
      //                       {
      //                         extTypeCheckbox: false,
      //                         epgu_selected_vs: {},
      //                         input: true,
      //                         dataGridLabel: false,
      //                         hideOnChildrenHidden: false,
      //                         tableView: true,
      //                         smev_req: {},
      //                         require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                         disabled: true,
      //                         label: "Номер заявления",
      //                         type: "textfield",
      //                         key: "params_handler_application",
      //                       },
      //                     ],
      //                     offset: 0,
      //                     size: "md",
      //                     width: 6,
      //                     push: 0,
      //                   },
      //                 ],
      //                 dataGridLabel: false,
      //                 smev_req: {},
      //                 tableView: false,
      //                 require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                 label: "Столбцы",
      //                 type: "columns",
      //                 key: "columns1",
      //                 esiaKey: {},
      //               },
      //               {
      //                 extTypeCheckbox: false,
      //                 epgu_selected_vs: {},
      //                 widget: "choicesjs",
      //                 data: {
      //                   values: [
      //                     {
      //                       label:
      //                         "Министерство промышленности и цифрового развития",
      //                       value:
      //                         "министерствоПромышленностиИЦифровогоРазвития",
      //                     },
      //                     {
      //                       label: "Министерство образования и науки",
      //                       value: "министерствоОбразованияИНауки",
      //                     },
      //                   ],
      //                   url: "https://demo.isands.ru/o/template/entity/undefined/?entityName=undefined&column=undefined&forSelect=true",
      //                 },
      //                 dataGridLabel: false,
      //                 tableView: true,
      //                 indexeddb: { filter: {}, database: "", table: "" },
      //                 require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                 label: "Уполномоченный орган",
      //                 type: "select",
      //                 reference: false,
      //                 selectedDictColumn: {},
      //                 input: true,
      //                 isSelectDict: true,
      //                 selectThreshold: 0.3,
      //                 addResource: false,
      //                 disableLimit: false,
      //                 smev_req: {},
      //                 key: "CompetentOrganization.Name",
      //                 validate: { select: false },
      //               },
      //               {
      //                 extTypeCheckbox: false,
      //                 epgu_selected_vs: {},
      //                 input: true,
      //                 defaultValue: false,
      //                 tableView: false,
      //                 smev_req: {},
      //                 require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                 label:
      //                   "Получить дополнительно результат на бумажном носителе",
      //                 type: "checkbox",
      //                 key: "MethodGettingResults.IsPaperDocumentRequired",
      //               },
      //               {
      //                 extTypeCheckbox: false,
      //                 epgu_selected_vs: {},
      //                 widget: "choicesjs",
      //                 hidden: true,
      //                 data: {
      //                   values: [
      //                     { label: "МФЦ", value: "1" },
      //                     {
      //                       label: "Личное обращение в уполномоченный орган",
      //                       value: "2",
      //                     },
      //                   ],
      //                 },
      //                 conditional: {
      //                   show: true,
      //                   eq: "true",
      //                   when: "MethodGettingResults.IsPaperDocumentRequired",
      //                 },
      //                 dataGridLabel: false,
      //                 tableView: true,
      //                 indexeddb: { filter: {}, database: "", table: "" },
      //                 require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                 label: "Способ получения результата",
      //                 type: "select",
      //                 reference: false,
      //                 selectedDictColumn: {},
      //                 input: true,
      //                 selectThreshold: 0.3,
      //                 addResource: false,
      //                 disableLimit: false,
      //                 smev_req: {},
      //                 key: "MethodGettingResults.FieldRadio",
      //                 validate: { select: false },
      //               },
      //               {
      //                 extTypeCheckbox: false,
      //                 epgu_selected_vs: {},
      //                 input: true,
      //                 dataGridLabel: false,
      //                 tableView: true,
      //                 smev_req: {},
      //                 require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                 label: "Комментарий к заявлению",
      //                 type: "textarea",
      //                 autoExpand: false,
      //                 isUploadEnabled: false,
      //                 key: "comment",
      //               },
      //             ],
      //             collapsed: false,
      //             dataGridLabel: false,
      //             allowPrevious: false,
      //             tableView: false,
      //             require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //             label: "Меню",
      //             title: "Меню",
      //             type: "panel",
      //             breadcrumbClickable: true,
      //             collapsible: true,
      //             buttonSettings: { cancel: true, next: true, previous: true },
      //             input: false,
      //             smev_req: {},
      //             theme: "info",
      //             key: "panel",
      //             esiaKey: {},
      //           },
      //           {
      //             extTypeCheckbox: false,
      //             epgu_selected_vs: {},
      //             components: [
      //               {
      //                 extTypeCheckbox: false,
      //                 epgu_selected_vs: {},
      //                 widget: "choicesjs",
      //                 data: {
      //                   values: [{ label: "", value: "" }],
      //                   url: "https://demo.isands.ru/o/template/entity/DictionaryPortletEndpoint/?entityName=DelegateInfo&column=DelegateInfo&forSelect=true",
      //                 },
      //                 dataGridLabel: false,
      //                 tableView: true,
      //                 indexeddb: { filter: {}, database: "", table: "" },
      //                 require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                 label: "Категория заявителя",
      //                 type: "select",
      //                 selectedDictCode: {
      //                   endpoint: "DictionaryPortletEndpoint",
      //                   columns: [
      //                     {
      //                       name: "DelegateInfo",
      //                       label: "Категория заявителя",
      //                       type: "STRING",
      //                       value: "DelegateInfo",
      //                     },
      //                   ],
      //                   name: "DelegateInfo",
      //                   label: "Категория заявителя",
      //                   value: "DelegateInfo",
      //                 },
      //                 valueProperty: "value",
      //                 reference: false,
      //                 selectedDictColumn: {
      //                   name: "DelegateInfo",
      //                   label: "Категория заявителя",
      //                   type: "STRING",
      //                   value: "DelegateInfo",
      //                 },
      //                 input: true,
      //                 idPath: "value",
      //                 isSelectDict: true,
      //                 selectThreshold: 0.3,
      //                 addResource: false,
      //                 disableLimit: false,
      //                 smev_req: {},
      //                 key: "DelegateInfo",
      //                 dataSrc: "url",
      //                 validate: { select: false, required: true },
      //               },
      //               {
      //                 extTypeCheckbox: false,
      //                 epgu_selected_vs: {},
      //                 components: [
      //                   {
      //                     extTypeCheckbox: false,
      //                     epgu_selected_vs: {},
      //                     input: false,
      //                     columns: [
      //                       {
      //                         pull: 0,
      //                         components: [
      //                           {
      //                             extTypeCheckbox: false,
      //                             epgu_selected_vs: {},
      //                             input: true,
      //                             dataGridLabel: false,
      //                             hideOnChildrenHidden: false,
      //                             tableView: true,
      //                             smev_req: {},
      //                             require: [
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                             ],
      //                             label: "Фамилия",
      //                             type: "textfield",
      //                             key: "Surname",
      //                           },
      //                         ],
      //                         offset: 0,
      //                         size: "md",
      //                         width: 4,
      //                         push: 0,
      //                       },
      //                       {
      //                         pull: 0,
      //                         components: [
      //                           {
      //                             extTypeCheckbox: false,
      //                             epgu_selected_vs: {},
      //                             input: true,
      //                             dataGridLabel: false,
      //                             hideOnChildrenHidden: false,
      //                             tableView: true,
      //                             smev_req: {},
      //                             require: [
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                             ],
      //                             label: "Имя",
      //                             type: "textfield",
      //                             key: "FirstName",
      //                           },
      //                         ],
      //                         offset: 0,
      //                         size: "md",
      //                         width: 4,
      //                         push: 0,
      //                       },
      //                       {
      //                         pull: 0,
      //                         components: [
      //                           {
      //                             extTypeCheckbox: false,
      //                             epgu_selected_vs: {},
      //                             input: true,
      //                             dataGridLabel: false,
      //                             hideOnChildrenHidden: false,
      //                             tableView: true,
      //                             smev_req: {},
      //                             require: [
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                             ],
      //                             label: "Отчество",
      //                             type: "textfield",
      //                             key: "Middlename",
      //                           },
      //                         ],
      //                         size: "md",
      //                         offset: 0,
      //                         width: 4,
      //                         push: 0,
      //                       },
      //                     ],
      //                     dataGridLabel: false,
      //                     smev_req: {},
      //                     tableView: false,
      //                     require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                     label: "Столбцы",
      //                     type: "columns",
      //                     key: "columns2",
      //                     esiaKey: {},
      //                   },
      //                   {
      //                     extTypeCheckbox: false,
      //                     epgu_selected_vs: {},
      //                     input: false,
      //                     columns: [
      //                       {
      //                         pull: 0,
      //                         components: [
      //                           {
      //                             extTypeCheckbox: false,
      //                             epgu_selected_vs: {},
      //                             widget: {
      //                               minDate: null,
      //                               enableTime: true,
      //                               format: "dd-MM-yyyy",
      //                               displayInTimezone: "viewer",
      //                               noCalendar: false,
      //                               type: "calendar",
      //                               locale: "ru",
      //                               time_24hr: false,
      //                               allowInput: true,
      //                               minuteIncrement: 1,
      //                               mode: "single",
      //                               useLocaleSettings: false,
      //                               maxDate: null,
      //                               hourIncrement: 1,
      //                             },
      //                             dataGridLabel: false,
      //                             hideOnChildrenHidden: false,
      //                             format: "dd-MM-yyyy",
      //                             tableView: false,
      //                             require: [
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                             ],
      //                             label: "Дата рождения",
      //                             type: "datetime",
      //                             input: true,
      //                             smev_req: {},
      //                             key: "dateTime1",
      //                           },
      //                         ],
      //                         offset: 0,
      //                         size: "md",
      //                         width: 4,
      //                         push: 0,
      //                       },
      //                       {
      //                         pull: 0,
      //                         components: [
      //                           {
      //                             extTypeCheckbox: false,
      //                             epgu_selected_vs: {},
      //                             input: true,
      //                             dataGridLabel: false,
      //                             hideOnChildrenHidden: false,
      //                             tableView: true,
      //                             smev_req: {},
      //                             require: [
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                             ],
      //                             label: "Гражданство",
      //                             type: "textfield",
      //                             key: "textField4",
      //                           },
      //                         ],
      //                         offset: 0,
      //                         size: "md",
      //                         width: 4,
      //                         push: 0,
      //                       },
      //                       {
      //                         pull: 0,
      //                         components: [
      //                           {
      //                             extTypeCheckbox: false,
      //                             epgu_selected_vs: {},
      //                             input: true,
      //                             dataGridLabel: false,
      //                             hideOnChildrenHidden: false,
      //                             tableView: true,
      //                             smev_req: {},
      //                             require: [
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                             ],
      //                             label: "СНИЛС",
      //                             inputMask: "999-999-999 99",
      //                             type: "textfield",
      //                             key: "textField5",
      //                           },
      //                         ],
      //                         size: "md",
      //                         offset: 0,
      //                         width: 4,
      //                         push: 0,
      //                       },
      //                     ],
      //                     dataGridLabel: false,
      //                     smev_req: {},
      //                     tableView: false,
      //                     require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                     label: "Столбцы",
      //                     type: "columns",
      //                     key: "columns3",
      //                     esiaKey: {},
      //                   },
      //                   {
      //                     extTypeCheckbox: false,
      //                     epgu_selected_vs: {},
      //                     input: false,
      //                     columns: [
      //                       {
      //                         pull: 0,
      //                         components: [],
      //                         offset: 0,
      //                         size: "md",
      //                         width: 4,
      //                         push: 0,
      //                       },
      //                       {
      //                         pull: 0,
      //                         components: [
      //                           {
      //                             extTypeCheckbox: false,
      //                             epgu_selected_vs: {},
      //                             input: true,
      //                             dataGridLabel: false,
      //                             hideOnChildrenHidden: false,
      //                             tableView: true,
      //                             smev_req: {},
      //                             require: [
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                             ],
      //                             label: "Телефон",
      //                             inputMask: "9 (999) 999-9999",
      //                             type: "phoneNumber",
      //                             key: "phoneNumber1",
      //                           },
      //                         ],
      //                         offset: 0,
      //                         size: "md",
      //                         width: 4,
      //                         push: 0,
      //                       },
      //                       {
      //                         pull: 0,
      //                         components: [
      //                           {
      //                             extTypeCheckbox: false,
      //                             epgu_selected_vs: {},
      //                             input: true,
      //                             dataGridLabel: false,
      //                             hideOnChildrenHidden: false,
      //                             tableView: true,
      //                             smev_req: {},
      //                             require: [
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                             ],
      //                             label: "Электронная почта",
      //                             type: "email",
      //                             key: "email",
      //                           },
      //                         ],
      //                         size: "md",
      //                         offset: 0,
      //                         width: 4,
      //                         push: 0,
      //                       },
      //                     ],
      //                     dataGridLabel: false,
      //                     smev_req: {},
      //                     tableView: false,
      //                     require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                     label: "Столбцы",
      //                     type: "columns",
      //                     key: "columns4",
      //                     esiaKey: {},
      //                   },
      //                 ],
      //                 hidden: true,
      //                 conditional: {
      //                   show: true,
      //                   eq: "1",
      //                   when: "DelegateInfo",
      //                 },
      //                 collapsed: false,
      //                 dataGridLabel: false,
      //                 allowPrevious: false,
      //                 tableView: false,
      //                 require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                 label: "Данные о заявителе",
      //                 title: "Данные о заявителе",
      //                 type: "panel",
      //                 breadcrumbClickable: true,
      //                 collapsible: true,
      //                 buttonSettings: {
      //                   cancel: true,
      //                   next: true,
      //                   previous: true,
      //                 },
      //                 input: false,
      //                 smev_req: {},
      //                 theme: "info",
      //                 key: "panel2",
      //                 esiaKey: {},
      //               },
      //               {
      //                 extTypeCheckbox: false,
      //                 epgu_selected_vs: {},
      //                 components: [
      //                   {
      //                     extTypeCheckbox: false,
      //                     epgu_selected_vs: {},
      //                     input: false,
      //                     columns: [
      //                       {
      //                         pull: 0,
      //                         components: [
      //                           {
      //                             extTypeCheckbox: false,
      //                             epgu_selected_vs: {},
      //                             input: true,
      //                             dataGridLabel: false,
      //                             hideOnChildrenHidden: false,
      //                             tableView: true,
      //                             smev_req: {},
      //                             require: [
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                             ],
      //                             label: "Фамилия",
      //                             type: "textfield",
      //                             key: "textField1",
      //                           },
      //                         ],
      //                         offset: 0,
      //                         size: "md",
      //                         width: 4,
      //                         push: 0,
      //                       },
      //                       {
      //                         pull: 0,
      //                         components: [
      //                           {
      //                             extTypeCheckbox: false,
      //                             epgu_selected_vs: {},
      //                             input: true,
      //                             dataGridLabel: false,
      //                             hideOnChildrenHidden: false,
      //                             tableView: true,
      //                             smev_req: {},
      //                             require: [
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                             ],
      //                             label: "Имя",
      //                             type: "textfield",
      //                             key: "textField6",
      //                           },
      //                         ],
      //                         offset: 0,
      //                         size: "md",
      //                         width: 4,
      //                         push: 0,
      //                       },
      //                       {
      //                         pull: 0,
      //                         components: [
      //                           {
      //                             extTypeCheckbox: false,
      //                             epgu_selected_vs: {},
      //                             input: true,
      //                             dataGridLabel: false,
      //                             hideOnChildrenHidden: false,
      //                             tableView: true,
      //                             smev_req: {},
      //                             require: [
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                             ],
      //                             label: "Отчество",
      //                             type: "textfield",
      //                             key: "textField7",
      //                           },
      //                         ],
      //                         size: "md",
      //                         offset: 0,
      //                         width: 4,
      //                         push: 0,
      //                       },
      //                     ],
      //                     dataGridLabel: false,
      //                     smev_req: {},
      //                     tableView: false,
      //                     require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                     label: "Столбцы",
      //                     type: "columns",
      //                     key: "columns5",
      //                     esiaKey: {},
      //                   },
      //                   {
      //                     extTypeCheckbox: false,
      //                     epgu_selected_vs: {},
      //                     input: false,
      //                     columns: [
      //                       {
      //                         pull: 0,
      //                         components: [
      //                           {
      //                             extTypeCheckbox: false,
      //                             epgu_selected_vs: {},
      //                             widget: {
      //                               minDate: null,
      //                               enableTime: true,
      //                               format: "dd-MM-yyyy",
      //                               displayInTimezone: "viewer",
      //                               noCalendar: false,
      //                               type: "calendar",
      //                               locale: "ru",
      //                               time_24hr: false,
      //                               allowInput: true,
      //                               minuteIncrement: 1,
      //                               mode: "single",
      //                               useLocaleSettings: false,
      //                               maxDate: null,
      //                               hourIncrement: 1,
      //                             },
      //                             dataGridLabel: false,
      //                             hideOnChildrenHidden: false,
      //                             format: "dd-MM-yyyy",
      //                             tableView: false,
      //                             require: [
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                             ],
      //                             label: "Дата рождения",
      //                             type: "datetime",
      //                             input: true,
      //                             smev_req: {},
      //                             key: "dateTime2",
      //                           },
      //                         ],
      //                         offset: 0,
      //                         size: "md",
      //                         width: 4,
      //                         push: 0,
      //                       },
      //                       {
      //                         pull: 0,
      //                         components: [
      //                           {
      //                             extTypeCheckbox: false,
      //                             epgu_selected_vs: {},
      //                             input: true,
      //                             dataGridLabel: false,
      //                             hideOnChildrenHidden: false,
      //                             tableView: true,
      //                             smev_req: {},
      //                             require: [
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                             ],
      //                             label: "Гражданство",
      //                             type: "textfield",
      //                             key: "textField8",
      //                           },
      //                         ],
      //                         offset: 0,
      //                         size: "md",
      //                         width: 4,
      //                         push: 0,
      //                       },
      //                       {
      //                         pull: 0,
      //                         components: [
      //                           {
      //                             extTypeCheckbox: false,
      //                             epgu_selected_vs: {},
      //                             input: true,
      //                             dataGridLabel: false,
      //                             hideOnChildrenHidden: false,
      //                             tableView: true,
      //                             smev_req: {},
      //                             require: [
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                             ],
      //                             label: "СНИЛС",
      //                             inputMask: "999-999-999 99",
      //                             type: "textfield",
      //                             key: "textField9",
      //                           },
      //                         ],
      //                         size: "md",
      //                         offset: 0,
      //                         width: 4,
      //                         push: 0,
      //                       },
      //                     ],
      //                     dataGridLabel: false,
      //                     smev_req: {},
      //                     tableView: false,
      //                     require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                     label: "Столбцы",
      //                     type: "columns",
      //                     key: "columns6",
      //                     esiaKey: {},
      //                   },
      //                   {
      //                     extTypeCheckbox: false,
      //                     epgu_selected_vs: {},
      //                     input: false,
      //                     columns: [
      //                       {
      //                         pull: 0,
      //                         components: [
      //                           {
      //                             extTypeCheckbox: false,
      //                             epgu_selected_vs: {},
      //                             widget: "choicesjs",
      //                             data: {
      //                               values: [
      //                                 { label: "Мужской", value: "1" },
      //                                 { label: "Женский", value: "2" },
      //                               ],
      //                               url: "https://demo.isands.ru/o/template/entity/DictionaryPortletEndpoint/?entityName=7895&column=7895&forSelect=true",
      //                             },
      //                             dataGridLabel: false,
      //                             hideOnChildrenHidden: false,
      //                             tableView: true,
      //                             indexeddb: {
      //                               filter: {},
      //                               database: "",
      //                               table: "",
      //                             },
      //                             require: [
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                             ],
      //                             label: "Пол",
      //                             type: "select",
      //                             selectedDictCode: {
      //                               endpoint: "DictionaryPortletEndpoint",
      //                               columns: [
      //                                 {
      //                                   name: "7895",
      //                                   label: "floor (пол)",
      //                                   type: "STRING",
      //                                   value: "7895",
      //                                 },
      //                               ],
      //                               name: "7895",
      //                               label: "floor (пол)",
      //                               value: "7895",
      //                             },
      //                             reference: false,
      //                             selectedDictColumn: {
      //                               name: "7895",
      //                               label: "floor (пол)",
      //                               type: "STRING",
      //                               value: "7895",
      //                             },
      //                             input: true,
      //                             selectThreshold: 0.3,
      //                             addResource: false,
      //                             disableLimit: false,
      //                             smev_req: {},
      //                             key: "select2",
      //                             validate: { select: false },
      //                           },
      //                         ],
      //                         offset: 0,
      //                         size: "md",
      //                         width: 4,
      //                         push: 0,
      //                       },
      //                       {
      //                         pull: 0,
      //                         components: [
      //                           {
      //                             extTypeCheckbox: false,
      //                             epgu_selected_vs: {},
      //                             input: true,
      //                             dataGridLabel: false,
      //                             hideOnChildrenHidden: false,
      //                             tableView: true,
      //                             smev_req: {},
      //                             require: [
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                             ],
      //                             label: "Телефон",
      //                             inputMask: "9 (999) 999-9999",
      //                             type: "phoneNumber",
      //                             key: "phoneNumber2",
      //                           },
      //                         ],
      //                         offset: 0,
      //                         size: "md",
      //                         width: 4,
      //                         push: 0,
      //                       },
      //                       {
      //                         pull: 0,
      //                         components: [
      //                           {
      //                             extTypeCheckbox: false,
      //                             epgu_selected_vs: {},
      //                             input: true,
      //                             dataGridLabel: false,
      //                             hideOnChildrenHidden: false,
      //                             tableView: true,
      //                             smev_req: {},
      //                             require: [
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                             ],
      //                             label: "Электронная почта",
      //                             type: "email",
      //                             key: "email1",
      //                           },
      //                         ],
      //                         size: "md",
      //                         offset: 0,
      //                         width: 4,
      //                         push: 0,
      //                       },
      //                     ],
      //                     dataGridLabel: false,
      //                     smev_req: {},
      //                     tableView: false,
      //                     require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                     label: "Столбцы",
      //                     type: "columns",
      //                     key: "columns7",
      //                     esiaKey: {},
      //                   },
      //                 ],
      //                 hidden: true,
      //                 conditional: {
      //                   show: true,
      //                   eq: "2",
      //                   when: "DelegateInfo",
      //                 },
      //                 collapsed: false,
      //                 dataGridLabel: false,
      //                 allowPrevious: false,
      //                 tableView: false,
      //                 require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                 label: "Данные о представителе заявителя",
      //                 title: "Данные о представителе заявителя",
      //                 type: "panel",
      //                 breadcrumbClickable: true,
      //                 collapsible: true,
      //                 buttonSettings: {
      //                   cancel: true,
      //                   next: true,
      //                   previous: true,
      //                 },
      //                 input: false,
      //                 smev_req: {},
      //                 theme: "info",
      //                 key: "panel4",
      //                 esiaKey: {},
      //               },
      //               {
      //                 extTypeCheckbox: false,
      //                 epgu_selected_vs: {},
      //                 components: [
      //                   {
      //                     extTypeCheckbox: false,
      //                     epgu_selected_vs: {},
      //                     widget: "choicesjs",
      //                     data: {
      //                       values: [
      //                         {
      //                           label:
      //                             "Паспорт гражданина Российской Федерации",
      //                           value: "1",
      //                         },
      //                         {
      //                           label:
      //                             "Удостоверение личности лица без гражданства",
      //                           value: "2",
      //                         },
      //                         {
      //                           label: "Паспорт иностранного гражданина",
      //                           value: "3",
      //                         },
      //                       ],
      //                       url: "https://demo.isands.ru/o/template/entity/undefined/?entityName=undefined&column=undefined&forSelect=true",
      //                     },
      //                     dataGridLabel: false,
      //                     tableView: true,
      //                     indexeddb: { filter: {}, database: "", table: "" },
      //                     require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                     label: "Наименование документа",
      //                     type: "select",
      //                     reference: false,
      //                     selectedDictColumn: {},
      //                     input: true,
      //                     selectThreshold: 0.3,
      //                     addResource: false,
      //                     disableLimit: false,
      //                     smev_req: {},
      //                     key: "select3",
      //                     validate: { select: false },
      //                   },
      //                   {
      //                     extTypeCheckbox: false,
      //                     epgu_selected_vs: {},
      //                     input: false,
      //                     columns: [
      //                       {
      //                         pull: 0,
      //                         components: [
      //                           {
      //                             extTypeCheckbox: false,
      //                             epgu_selected_vs: {},
      //                             input: true,
      //                             dataGridLabel: false,
      //                             hideOnChildrenHidden: false,
      //                             tableView: true,
      //                             smev_req: {},
      //                             require: [
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                             ],
      //                             label: "Серия",
      //                             type: "textfield",
      //                             key: "textField11",
      //                           },
      //                         ],
      //                         offset: 0,
      //                         size: "md",
      //                         width: 3,
      //                         push: 0,
      //                       },
      //                       {
      //                         pull: 0,
      //                         components: [
      //                           {
      //                             extTypeCheckbox: false,
      //                             epgu_selected_vs: {},
      //                             input: true,
      //                             dataGridLabel: false,
      //                             hideOnChildrenHidden: false,
      //                             tableView: true,
      //                             smev_req: {},
      //                             require: [
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                             ],
      //                             label: "Номер",
      //                             type: "textfield",
      //                             key: "textField12",
      //                           },
      //                         ],
      //                         offset: 0,
      //                         size: "md",
      //                         width: 3,
      //                         push: 0,
      //                       },
      //                       {
      //                         pull: 0,
      //                         components: [
      //                           {
      //                             extTypeCheckbox: false,
      //                             epgu_selected_vs: {},
      //                             widget: {
      //                               minDate: null,
      //                               enableTime: true,
      //                               format: "dd-MM-yyyy",
      //                               displayInTimezone: "viewer",
      //                               noCalendar: false,
      //                               type: "calendar",
      //                               locale: "ru",
      //                               time_24hr: false,
      //                               allowInput: true,
      //                               minuteIncrement: 1,
      //                               mode: "single",
      //                               useLocaleSettings: false,
      //                               maxDate: null,
      //                               hourIncrement: 1,
      //                             },
      //                             dataGridLabel: false,
      //                             hideOnChildrenHidden: false,
      //                             format: "dd-MM-yyyy",
      //                             tableView: false,
      //                             require: [
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                             ],
      //                             label: "Дата выдачи",
      //                             type: "datetime",
      //                             input: true,
      //                             smev_req: {},
      //                             key: "dateTime3",
      //                           },
      //                         ],
      //                         size: "md",
      //                         offset: 0,
      //                         width: 3,
      //                         push: 0,
      //                       },
      //                       {
      //                         pull: 0,
      //                         components: [
      //                           {
      //                             extTypeCheckbox: false,
      //                             epgu_selected_vs: {},
      //                             widget: {
      //                               minDate: null,
      //                               enableTime: true,
      //                               format: "dd-MM-yyyy",
      //                               displayInTimezone: "viewer",
      //                               noCalendar: false,
      //                               type: "calendar",
      //                               locale: "ru",
      //                               time_24hr: false,
      //                               allowInput: true,
      //                               minuteIncrement: 1,
      //                               mode: "single",
      //                               useLocaleSettings: false,
      //                               maxDate: null,
      //                               hourIncrement: 1,
      //                             },
      //                             dataGridLabel: false,
      //                             hideOnChildrenHidden: false,
      //                             format: "dd-MM-yyyy",
      //                             tableView: false,
      //                             require: [
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                             ],
      //                             label: "Срок действия",
      //                             type: "datetime",
      //                             input: true,
      //                             smev_req: {},
      //                             key: "dateTime4",
      //                           },
      //                         ],
      //                         size: "md",
      //                         offset: 0,
      //                         width: 3,
      //                         push: 0,
      //                       },
      //                     ],
      //                     dataGridLabel: false,
      //                     smev_req: {},
      //                     tableView: false,
      //                     require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                     label: "Столбцы",
      //                     type: "columns",
      //                     key: "columns8",
      //                     esiaKey: {},
      //                   },
      //                   {
      //                     extTypeCheckbox: false,
      //                     epgu_selected_vs: {},
      //                     input: false,
      //                     columns: [
      //                       {
      //                         pull: 0,
      //                         components: [
      //                           {
      //                             extTypeCheckbox: false,
      //                             epgu_selected_vs: {},
      //                             input: true,
      //                             dataGridLabel: false,
      //                             hideOnChildrenHidden: false,
      //                             tableView: true,
      //                             smev_req: {},
      //                             require: [
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                             ],
      //                             label: "Кем выдан",
      //                             type: "textfield",
      //                             key: "textField13",
      //                           },
      //                         ],
      //                         offset: 0,
      //                         size: "md",
      //                         width: 6,
      //                         push: 0,
      //                       },
      //                       {
      //                         pull: 0,
      //                         components: [
      //                           {
      //                             extTypeCheckbox: false,
      //                             epgu_selected_vs: {},
      //                             input: true,
      //                             dataGridLabel: false,
      //                             hideOnChildrenHidden: false,
      //                             tableView: true,
      //                             smev_req: {},
      //                             require: [
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                             ],
      //                             label: "Код подразделения",
      //                             type: "textfield",
      //                             key: "textField14",
      //                           },
      //                         ],
      //                         offset: 0,
      //                         size: "md",
      //                         width: 6,
      //                         push: 0,
      //                       },
      //                     ],
      //                     dataGridLabel: false,
      //                     smev_req: {},
      //                     tableView: false,
      //                     require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                     label: "Столбцы",
      //                     type: "columns",
      //                     key: "columns9",
      //                     esiaKey: {},
      //                   },
      //                 ],
      //                 collapsed: false,
      //                 dataGridLabel: false,
      //                 allowPrevious: false,
      //                 tableView: false,
      //                 require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                 label: "Документ, удостоверяющий личность",
      //                 title: "Документ, удостоверяющий личность",
      //                 type: "panel",
      //                 breadcrumbClickable: true,
      //                 collapsible: true,
      //                 buttonSettings: {
      //                   cancel: true,
      //                   next: true,
      //                   previous: true,
      //                 },
      //                 input: false,
      //                 smev_req: {},
      //                 theme: "info",
      //                 key: "panel3",
      //                 esiaKey: {},
      //               },
      //             ],
      //             legend: "Сведения о заявителе/представителе заявителя",
      //             dataGridLabel: false,
      //             tableView: false,
      //             require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //             label: "Сведения о заявителе/представителе заявителя",
      //             type: "fieldset",
      //             input: false,
      //             smev_req: {},
      //             key: "fieldSet3",
      //             esiaKey: {},
      //           },
      //           {
      //             extTypeCheckbox: false,
      //             epgu_selected_vs: {},
      //             components: [
      //               {
      //                 extTypeCheckbox: false,
      //                 epgu_selected_vs: {},
      //                 widget: "choicesjs",
      //                 data: {
      //                   values: [
      //                     {
      //                       label: "Первая квалификационная категория",
      //                       value: "1",
      //                     },
      //                     {
      //                       label: "Высшая квалификационная категория",
      //                       value: "2",
      //                     },
      //                   ],
      //                 },
      //                 dataGridLabel: false,
      //                 tableView: true,
      //                 indexeddb: { filter: {}, database: "", table: "" },
      //                 require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                 label:
      //                   "На какую квалификационную категорию претендует заявитель?",
      //                 type: "select",
      //                 reference: false,
      //                 selectedDictColumn: {},
      //                 input: true,
      //                 selectThreshold: 0.3,
      //                 addResource: false,
      //                 disableLimit: false,
      //                 smev_req: {},
      //                 key: "KP_APR_03",
      //                 validate: { select: false },
      //               },
      //               {
      //                 extTypeCheckbox: false,
      //                 epgu_selected_vs: {},
      //                 widget: "choicesjs",
      //                 hidden: true,
      //                 data: {
      //                   values: [
      //                     {
      //                       label: "Квалификационная категория не установлена",
      //                       value: "1",
      //                     },
      //                     {
      //                       label: "Квалификационная категория установлена",
      //                       value: "2",
      //                     },
      //                   ],
      //                 },
      //                 conditional: { show: true, eq: "1", when: "KP_APR_03" },
      //                 dataGridLabel: false,
      //                 tableView: true,
      //                 indexeddb: { filter: {}, database: "", table: "" },
      //                 require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                 label: "Квалификационная категория установлена?",
      //                 type: "select",
      //                 reference: false,
      //                 selectedDictColumn: {},
      //                 input: true,
      //                 selectThreshold: 0.3,
      //                 addResource: false,
      //                 disableLimit: false,
      //                 smev_req: {},
      //                 key: "VariantChoiceT.KP_APR_04",
      //                 validate: { select: false },
      //               },
      //               {
      //                 extTypeCheckbox: false,
      //                 epgu_selected_vs: {},
      //                 widget: "choicesjs",
      //                 hidden: true,
      //                 data: {
      //                   values: [
      //                     {
      //                       label: "Аттестация ранее не проводилась",
      //                       value: "1",
      //                     },
      //                     { label: "Аттестация проводилась", value: "2" },
      //                   ],
      //                 },
      //                 conditional: { show: true, eq: "1", when: "KP_APR_03" },
      //                 dataGridLabel: false,
      //                 tableView: true,
      //                 indexeddb: { filter: {}, database: "", table: "" },
      //                 require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                 label: "Аттестация ранее проводилась?",
      //                 type: "select",
      //                 reference: false,
      //                 selectedDictColumn: {},
      //                 input: true,
      //                 selectThreshold: 0.3,
      //                 addResource: false,
      //                 disableLimit: false,
      //                 smev_req: {},
      //                 key: "VariantChoice.KP_APR_05",
      //                 validate: { select: false },
      //               },
      //               {
      //                 extTypeCheckbox: false,
      //                 epgu_selected_vs: {},
      //                 widget: "choicesjs",
      //                 data: {
      //                   values: [
      //                     {
      //                       label: "Заявитель повышал квалификацию",
      //                       value: "1",
      //                     },
      //                     {
      //                       label: "Заявитель не повышал квалификацию",
      //                       value: "2",
      //                     },
      //                   ],
      //                 },
      //                 dataGridLabel: false,
      //                 tableView: true,
      //                 indexeddb: { filter: {}, database: "", table: "" },
      //                 require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                 label: "Заявитель повышал квалификацию?",
      //                 type: "select",
      //                 reference: false,
      //                 selectedDictColumn: {},
      //                 input: true,
      //                 selectThreshold: 0.3,
      //                 addResource: false,
      //                 disableLimit: false,
      //                 smev_req: {},
      //                 key: "VariantChoice.KP_APR_06",
      //                 validate: { select: false, required: true },
      //               },
      //               {
      //                 extTypeCheckbox: false,
      //                 epgu_selected_vs: {},
      //                 components: [
      //                   {
      //                     extTypeCheckbox: false,
      //                     epgu_selected_vs: {},
      //                     input: false,
      //                     columns: [
      //                       {
      //                         pull: 0,
      //                         components: [],
      //                         offset: 0,
      //                         size: "md",
      //                         width: 6,
      //                         push: 0,
      //                       },
      //                       {
      //                         pull: 0,
      //                         components: [],
      //                         offset: 0,
      //                         size: "md",
      //                         width: 6,
      //                         push: 0,
      //                       },
      //                     ],
      //                     dataGridLabel: false,
      //                     smev_req: {},
      //                     tableView: false,
      //                     require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                     label: "Столбцы",
      //                     type: "columns",
      //                     key: "columns10",
      //                     esiaKey: {},
      //                   },
      //                 ],
      //                 hidden: true,
      //                 conditional: {
      //                   show: true,
      //                   eq: "1",
      //                   when: "VariantChoice.KP_APR_06",
      //                 },
      //                 collapsed: false,
      //                 dataGridLabel: false,
      //                 allowPrevious: false,
      //                 tableView: false,
      //                 require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                 label: "Сведения о повышении квалификации",
      //                 title: "Сведения о повышении квалификации",
      //                 type: "panel",
      //                 breadcrumbClickable: true,
      //                 collapsible: true,
      //                 buttonSettings: {
      //                   cancel: true,
      //                   next: true,
      //                   previous: true,
      //                 },
      //                 input: false,
      //                 smev_req: {},
      //                 theme: "info",
      //                 key: "panel11",
      //                 esiaKey: {},
      //               },
      //               {
      //                 extTypeCheckbox: false,
      //                 epgu_selected_vs: {},
      //                 widget: "choicesjs",
      //                 data: {
      //                   values: [
      //                     { label: "Имеет", value: "1" },
      //                     { label: "Не имеет", value: "2" },
      //                   ],
      //                 },
      //                 dataGridLabel: false,
      //                 tableView: true,
      //                 indexeddb: { filter: {}, database: "", table: "" },
      //                 require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                 label: "Заявитель имеет награды, звания, ученые степени?",
      //                 type: "select",
      //                 reference: false,
      //                 selectedDictColumn: {},
      //                 input: true,
      //                 selectThreshold: 0.3,
      //                 addResource: false,
      //                 disableLimit: false,
      //                 smev_req: {},
      //                 key: "VariantChoice.KP_APR_07",
      //                 validate: { select: false, required: true },
      //               },
      //               {
      //                 extTypeCheckbox: false,
      //                 epgu_selected_vs: {},
      //                 components: [
      //                   {
      //                     extTypeCheckbox: false,
      //                     epgu_selected_vs: {},
      //                     components: [
      //                       {
      //                         extTypeCheckbox: false,
      //                         epgu_selected_vs: {},
      //                         input: false,
      //                         components: [
      //                           {
      //                             extTypeCheckbox: false,
      //                             epgu_selected_vs: {},
      //                             input: true,
      //                             dataGridLabel: false,
      //                             tableView: true,
      //                             smev_req: {},
      //                             require: [
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                             ],
      //                             label:
      //                               "Наименование награды, звания, ученой степени, ученого звания ",
      //                             type: "textfield",
      //                             key: "textField28",
      //                             validate: { required: true },
      //                           },
      //                           {
      //                             hideInputLabels: false,
      //                             extTypeCheckbox: false,
      //                             epgu_selected_vs: {},
      //                             defaultValue: "00/00/0000",
      //                             dataGridLabel: false,
      //                             tableView: false,
      //                             require: [
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                             ],
      //                             label: "Год получения",
      //                             type: "day",
      //                             useLocaleSettings: false,
      //                             input: true,
      //                             inputsLabelPosition: "top",
      //                             smev_req: {},
      //                             fields: {
      //                               month: { hide: true },
      //                               year: { hide: false },
      //                               day: { hide: true },
      //                             },
      //                             key: "day2",
      //                             hideLabel: true,
      //                           },
      //                         ],
      //                         dataGridLabel: false,
      //                         smev_req: {},
      //                         tableView: false,
      //                         require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                         label: "",
      //                         type: "fieldset",
      //                         key: "fieldSet1",
      //                         esiaKey: {},
      //                       },
      //                     ],
      //                     enableRowGroups: false,
      //                     defaultValue: [{}],
      //                     dataGridLabel: false,
      //                     tableView: false,
      //                     reorder: false,
      //                     require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                     label: "Сведения о заслугах ",
      //                     layoutFixed: false,
      //                     type: "datagrid",
      //                     initEmpty: false,
      //                     input: true,
      //                     groupToggle: false,
      //                     defaultOpen: false,
      //                     smev_req: {},
      //                     addAnotherPosition: "bottom",
      //                     key: "dataGrid1",
      //                     hideLabel: true,
      //                   },
      //                 ],
      //                 hidden: true,
      //                 conditional: {
      //                   show: true,
      //                   eq: "1",
      //                   when: "VariantChoice.KP_APR_07",
      //                 },
      //                 collapsed: false,
      //                 dataGridLabel: false,
      //                 allowPrevious: false,
      //                 tableView: false,
      //                 require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                 label: "Сведения о заслугах",
      //                 title: "Сведения о заслугах",
      //                 type: "panel",
      //                 breadcrumbClickable: true,
      //                 collapsible: true,
      //                 buttonSettings: {
      //                   cancel: true,
      //                   next: true,
      //                   previous: true,
      //                 },
      //                 input: false,
      //                 smev_req: {},
      //                 theme: "info",
      //                 key: "panel10",
      //                 esiaKey: {},
      //               },
      //               {
      //                 extTypeCheckbox: false,
      //                 epgu_selected_vs: {},
      //                 widget: "choicesjs",
      //                 data: {
      //                   values: [
      //                     { label: "Не изменялись", value: "1" },
      //                     { label: "Изменялись", value: "2" },
      //                   ],
      //                 },
      //                 dataGridLabel: false,
      //                 tableView: true,
      //                 indexeddb: { filter: {}, database: "", table: "" },
      //                 require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                 label: "Изменялись фамилия, имя, отчество заявителя?",
      //                 type: "select",
      //                 reference: false,
      //                 selectedDictColumn: {},
      //                 input: true,
      //                 selectThreshold: 0.3,
      //                 addResource: false,
      //                 disableLimit: false,
      //                 smev_req: {},
      //                 key: "VariantChoice.KP_APR_08",
      //                 validate: { select: false, required: true },
      //               },
      //               {
      //                 extTypeCheckbox: false,
      //                 epgu_selected_vs: {},
      //                 components: [
      //                   {
      //                     extTypeCheckbox: false,
      //                     epgu_selected_vs: {},
      //                     input: true,
      //                     defaultValue: false,
      //                     tableView: false,
      //                     smev_req: {},
      //                     require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                     label: "Расторжение брака",
      //                     type: "checkbox",
      //                     key: "VariantChoice.KP_APR_09.Divorce",
      //                   },
      //                   {
      //                     extTypeCheckbox: false,
      //                     epgu_selected_vs: {},
      //                     input: true,
      //                     defaultValue: false,
      //                     tableView: false,
      //                     smev_req: {},
      //                     require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                     label: "Иные причины",
      //                     type: "checkbox",
      //                     key: "VariantChoice.KP_APR_09OtherReasons",
      //                   },
      //                   {
      //                     extTypeCheckbox: false,
      //                     epgu_selected_vs: {},
      //                     hidden: true,
      //                     conditional: {
      //                       show: true,
      //                       eq: "true",
      //                       when: "VariantChoice.KP_APR_09OtherReasons",
      //                     },
      //                     dataGridLabel: false,
      //                     tableView: true,
      //                     require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                     label: "Иные причины",
      //                     type: "textfield",
      //                     input: true,
      //                     smev_req: {},
      //                     key: "textField42",
      //                     customConditional:
      //                       "show = data.VariantChoice.KP_APR_09.OtherReasons === true",
      //                   },
      //                 ],
      //                 hidden: true,
      //                 conditional: {
      //                   show: true,
      //                   eq: "2",
      //                   when: "VariantChoice.KP_APR_08",
      //                 },
      //                 collapsed: false,
      //                 dataGridLabel: false,
      //                 allowPrevious: false,
      //                 tableView: false,
      //                 require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                 label:
      //                   "С чем связано изменение фамилии, имени и отчества?",
      //                 title:
      //                   "С чем связано изменение фамилии, имени и отчества?",
      //                 type: "panel",
      //                 breadcrumbClickable: true,
      //                 collapsible: true,
      //                 buttonSettings: {
      //                   cancel: true,
      //                   next: true,
      //                   previous: true,
      //                 },
      //                 input: false,
      //                 smev_req: {},
      //                 theme: "info",
      //                 key: "VariantChoice.KP_APR_09",
      //                 esiaKey: {},
      //               },
      //               {
      //                 extTypeCheckbox: false,
      //                 epgu_selected_vs: {},
      //                 widget: "choicesjs",
      //                 data: {
      //                   values: [
      //                     { label: "Будет принимать участие", value: "1" },
      //                     { label: "Не будет принимать участие", value: "2" },
      //                   ],
      //                 },
      //                 dataGridLabel: false,
      //                 tableView: true,
      //                 indexeddb: { filter: {}, database: "", table: "" },
      //                 require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                 label:
      //                   "Заявитель будет принимать участие в заседании аттестационной комиссии?",
      //                 type: "select",
      //                 reference: false,
      //                 selectedDictColumn: {},
      //                 input: true,
      //                 selectThreshold: 0.3,
      //                 addResource: false,
      //                 disableLimit: false,
      //                 smev_req: {},
      //                 key: "VariantChoice.KP_APR_10",
      //                 validate: { select: false },
      //               },
      //               {
      //                 extTypeCheckbox: false,
      //                 epgu_selected_vs: {},
      //                 components: [
      //                   {
      //                     extTypeCheckbox: false,
      //                     epgu_selected_vs: {},
      //                     input: true,
      //                     dataGridLabel: false,
      //                     tableView: true,
      //                     smev_req: {},
      //                     require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                     label: "Место работы",
      //                     type: "textfield",
      //                     key: "textField15",
      //                   },
      //                   {
      //                     extTypeCheckbox: false,
      //                     epgu_selected_vs: {},
      //                     input: true,
      //                     dataGridLabel: false,
      //                     tableView: true,
      //                     smev_req: {},
      //                     require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                     label: "Должность",
      //                     type: "textfield",
      //                     key: "textField16",
      //                   },
      //                 ],
      //                 collapsed: false,
      //                 dataGridLabel: false,
      //                 allowPrevious: false,
      //                 tableView: false,
      //                 require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                 label: "Сведения о месте работы и должности ",
      //                 title: "Сведения о месте работы и должности ",
      //                 type: "panel",
      //                 breadcrumbClickable: true,
      //                 collapsible: true,
      //                 buttonSettings: {
      //                   cancel: true,
      //                   next: true,
      //                   previous: true,
      //                 },
      //                 input: false,
      //                 smev_req: {},
      //                 theme: "info",
      //                 key: "panel5",
      //                 esiaKey: {},
      //               },
      //               {
      //                 extTypeCheckbox: false,
      //                 epgu_selected_vs: {},
      //                 components: [
      //                   {
      //                     extTypeCheckbox: false,
      //                     epgu_selected_vs: {},
      //                     components: [
      //                       {
      //                         extTypeCheckbox: false,
      //                         epgu_selected_vs: {},
      //                         input: false,
      //                         components: [
      //                           {
      //                             extTypeCheckbox: false,
      //                             epgu_selected_vs: {},
      //                             input: true,
      //                             dataGridLabel: false,
      //                             tableView: true,
      //                             smev_req: {},
      //                             require: [
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                             ],
      //                             label: "Уровень образования",
      //                             type: "textfield",
      //                             key: "textField17",
      //                           },
      //                           {
      //                             extTypeCheckbox: false,
      //                             epgu_selected_vs: {},
      //                             input: true,
      //                             dataGridLabel: false,
      //                             tableView: true,
      //                             smev_req: {},
      //                             require: [
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                             ],
      //                             label:
      //                               "Наименование образовательной организации",
      //                             type: "textfield",
      //                             key: "textField18",
      //                           },
      //                           {
      //                             extTypeCheckbox: false,
      //                             epgu_selected_vs: {},
      //                             input: true,
      //                             dataGridLabel: false,
      //                             tableView: true,
      //                             smev_req: {},
      //                             require: [
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                             ],
      //                             label: "Полученная специальность",
      //                             type: "textfield",
      //                             key: "textField10",
      //                           },
      //                           {
      //                             extTypeCheckbox: false,
      //                             epgu_selected_vs: {},
      //                             input: true,
      //                             dataGridLabel: false,
      //                             tableView: true,
      //                             smev_req: {},
      //                             require: [
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                             ],
      //                             label: "Квалификация",
      //                             type: "textfield",
      //                             key: "textField20",
      //                           },
      //                           {
      //                             hideInputLabels: false,
      //                             extTypeCheckbox: false,
      //                             epgu_selected_vs: {},
      //                             defaultValue: "00/00/0000",
      //                             dataGridLabel: false,
      //                             tableView: false,
      //                             require: [
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                               {},
      //                             ],
      //                             label: "День",
      //                             type: "day",
      //                             useLocaleSettings: false,
      //                             input: true,
      //                             inputsLabelPosition: "top",
      //                             smev_req: {},
      //                             fields: {
      //                               month: { hide: true },
      //                               year: { hide: false },
      //                               day: { hide: true },
      //                             },
      //                             key: "day",
      //                             hideLabel: true,
      //                           },
      //                         ],
      //                         dataGridLabel: false,
      //                         smev_req: {},
      //                         tableView: false,
      //                         require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                         label: "",
      //                         type: "fieldset",
      //                         key: "fieldSet1",
      //                         esiaKey: {},
      //                       },
      //                     ],
      //                     enableRowGroups: false,
      //                     defaultValue: [
      //                       {
      //                         dateTime5: "",
      //                         textField20: "",
      //                         textField10: "",
      //                         textField17: "",
      //                         textField18: "",
      //                       },
      //                     ],
      //                     dataGridLabel: false,
      //                     tableView: false,
      //                     reorder: false,
      //                     require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                     label: "Сведения о полученном образовании ",
      //                     layoutFixed: false,
      //                     type: "datagrid",
      //                     initEmpty: false,
      //                     input: true,
      //                     groupToggle: false,
      //                     defaultOpen: false,
      //                     smev_req: {},
      //                     addAnotherPosition: "bottom",
      //                     key: "dataGrid",
      //                     hideLabel: true,
      //                   },
      //                   {
      //                     extTypeCheckbox: false,
      //                     epgu_selected_vs: {},
      //                     components: [
      //                       {
      //                         extTypeCheckbox: false,
      //                         epgu_selected_vs: {},
      //                         input: true,
      //                         dataGridLabel: false,
      //                         tableView: true,
      //                         smev_req: {},
      //                         require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                         label: "Номер решения об отказе ",
      //                         type: "textfield",
      //                         key: "textField21",
      //                       },
      //                       {
      //                         extTypeCheckbox: false,
      //                         epgu_selected_vs: {},
      //                         input: true,
      //                         widget: {
      //                           minDate: null,
      //                           enableTime: true,
      //                           format: "dd-MM-yyyy",
      //                           displayInTimezone: "viewer",
      //                           noCalendar: false,
      //                           type: "calendar",
      //                           locale: "ru",
      //                           time_24hr: false,
      //                           allowInput: true,
      //                           minuteIncrement: 1,
      //                           mode: "single",
      //                           useLocaleSettings: false,
      //                           maxDate: null,
      //                           hourIncrement: 1,
      //                         },
      //                         dataGridLabel: false,
      //                         format: "dd-MM-yyyy",
      //                         tableView: false,
      //                         smev_req: {},
      //                         require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                         label: "Дата отказа в установлении категории",
      //                         type: "datetime",
      //                         key: "dateTime6",
      //                       },
      //                       {
      //                         extTypeCheckbox: false,
      //                         epgu_selected_vs: {},
      //                         input: true,
      //                         dataGridLabel: false,
      //                         tableView: true,
      //                         smev_req: {},
      //                         require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                         label: "Наименование органа, принявшего решение ",
      //                         type: "textfield",
      //                         key: "textField22",
      //                       },
      //                     ],
      //                     hidden: true,
      //                     conditional: {
      //                       show: true,
      //                       eq: "2",
      //                       when: "VariantChoice.KP_APR_05",
      //                     },
      //                     collapsed: false,
      //                     dataGridLabel: false,
      //                     allowPrevious: false,
      //                     tableView: false,
      //                     require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                     label:
      //                       "Реквизиты решения об отказе в установлении квалификационной категории",
      //                     title:
      //                       "Реквизиты решения об отказе в установлении квалификационной категории",
      //                     type: "panel",
      //                     breadcrumbClickable: true,
      //                     collapsible: true,
      //                     buttonSettings: {
      //                       cancel: true,
      //                       next: true,
      //                       previous: true,
      //                     },
      //                     input: false,
      //                     smev_req: {},
      //                     theme: "info",
      //                     key: "panel7",
      //                     esiaKey: {},
      //                   },
      //                   {
      //                     extTypeCheckbox: false,
      //                     epgu_selected_vs: {},
      //                     components: [
      //                       {
      //                         extTypeCheckbox: false,
      //                         epgu_selected_vs: {},
      //                         input: true,
      //                         dataGridLabel: false,
      //                         tableView: true,
      //                         smev_req: {},
      //                         require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                         label: "Номер решения ",
      //                         type: "textfield",
      //                         key: "textField23",
      //                       },
      //                       {
      //                         extTypeCheckbox: false,
      //                         epgu_selected_vs: {},
      //                         input: true,
      //                         widget: {
      //                           minDate: null,
      //                           enableTime: true,
      //                           format: "dd-MM-yyyy",
      //                           displayInTimezone: "viewer",
      //                           noCalendar: false,
      //                           type: "calendar",
      //                           locale: "ru",
      //                           time_24hr: false,
      //                           allowInput: true,
      //                           minuteIncrement: 1,
      //                           mode: "single",
      //                           useLocaleSettings: false,
      //                           maxDate: null,
      //                           hourIncrement: 1,
      //                         },
      //                         dataGridLabel: false,
      //                         format: "dd-MM-yyyy",
      //                         tableView: false,
      //                         smev_req: {},
      //                         require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                         label: "Дата установления категории ",
      //                         type: "datetime",
      //                         key: "dateTime7",
      //                       },
      //                       {
      //                         extTypeCheckbox: false,
      //                         epgu_selected_vs: {},
      //                         input: true,
      //                         dataGridLabel: false,
      //                         tableView: true,
      //                         smev_req: {},
      //                         require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                         label: "Наименование органа, принявшего решение ",
      //                         type: "textfield",
      //                         key: "textField24",
      //                       },
      //                     ],
      //                     conditional: {
      //                       show: false,
      //                       eq: "2",
      //                       when: "VariantChoiceT.KP_APR_04",
      //                     },
      //                     collapsed: false,
      //                     dataGridLabel: false,
      //                     allowPrevious: false,
      //                     tableView: false,
      //                     require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                     label:
      //                       "Реквизиты решения об установлении квалификационной категории",
      //                     title:
      //                       "Реквизиты решения об установлении квалификационной категории",
      //                     type: "panel",
      //                     breadcrumbClickable: true,
      //                     collapsible: true,
      //                     buttonSettings: {
      //                       cancel: true,
      //                       next: true,
      //                       previous: true,
      //                     },
      //                     input: false,
      //                     smev_req: {},
      //                     theme: "info",
      //                     key: "panel8",
      //                     esiaKey: {},
      //                   },
      //                   {
      //                     extTypeCheckbox: false,
      //                     epgu_selected_vs: {},
      //                     components: [
      //                       {
      //                         extTypeCheckbox: false,
      //                         epgu_selected_vs: {},
      //                         input: true,
      //                         dataGridLabel: false,
      //                         tableView: true,
      //                         smev_req: {},
      //                         require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                         label: "Общий педагогический стаж ",
      //                         type: "textfield",
      //                         key: "textField25",
      //                       },
      //                       {
      //                         extTypeCheckbox: false,
      //                         epgu_selected_vs: {},
      //                         input: true,
      //                         dataGridLabel: false,
      //                         tableView: true,
      //                         smev_req: {},
      //                         require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                         label: "Стаж работы в занимаемой должности ",
      //                         type: "textfield",
      //                         key: "textField26",
      //                       },
      //                       {
      //                         extTypeCheckbox: false,
      //                         epgu_selected_vs: {},
      //                         input: true,
      //                         dataGridLabel: false,
      //                         tableView: true,
      //                         smev_req: {},
      //                         require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                         label:
      //                           "Стаж работы в образовательной организации ",
      //                         type: "textfield",
      //                         key: "textField27",
      //                       },
      //                     ],
      //                     collapsed: false,
      //                     dataGridLabel: false,
      //                     allowPrevious: false,
      //                     tableView: false,
      //                     require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                     label: "Сведения о педагогическом стаже работы ",
      //                     title: "Сведения о педагогическом стаже работы ",
      //                     type: "panel",
      //                     breadcrumbClickable: true,
      //                     collapsible: true,
      //                     buttonSettings: {
      //                       cancel: true,
      //                       next: true,
      //                       previous: true,
      //                     },
      //                     input: false,
      //                     smev_req: {},
      //                     theme: "info",
      //                     key: "panel9",
      //                     esiaKey: {},
      //                   },
      //                 ],
      //                 collapsed: false,
      //                 dataGridLabel: false,
      //                 allowPrevious: false,
      //                 tableView: false,
      //                 require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                 label: "Сведения о полученном образовании ",
      //                 title: "Сведения о полученном образовании ",
      //                 type: "panel",
      //                 breadcrumbClickable: true,
      //                 collapsible: true,
      //                 buttonSettings: {
      //                   cancel: true,
      //                   next: true,
      //                   previous: true,
      //                 },
      //                 input: false,
      //                 smev_req: {},
      //                 theme: "info",
      //                 key: "panel6",
      //                 esiaKey: {},
      //               },
      //             ],
      //             legend: "Сведения для получения услуги",
      //             dataGridLabel: false,
      //             tableView: false,
      //             require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //             label: "Сведения для получения услуги",
      //             type: "fieldset",
      //             input: false,
      //             smev_req: {},
      //             key: "fieldSet2",
      //             esiaKey: {},
      //           },
      //           {
      //             extTypeCheckbox: false,
      //             epgu_selected_vs: {},
      //             dataGridLabel: false,
      //             tableView: false,
      //             require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //             label:
      //               "Документы, подтверждающие личные профессиональные достижения",
      //             type: "file",
      //             url: "/o/template/files/uploadFormFile",
      //             fileTypes: [{ label: "", value: "" }],
      //             input: true,
      //             webcam: false,
      //             smev_req: {},
      //             key: "file1",
      //           },
      //         ],
      //       },
      //       modelId: 18604,
      //       actions: [
      //         {
      //           id: 40566,
      //           name: "Сохранить",
      //           modelId: 18604,
      //           formId: 49840,
      //           alwaysActive: false,
      //           notRequiredAction: false,
      //           backAction: false,
      //         },
      //       ],
      //     },
      //     type: 1,
      //     startDate: "2022-01-14T09:58:28.174+00:00",
      //     endDate: null,
      //     active: true,
      //     archive: false,
      //   },
      //   errors: [],
      //   responseObject: null,
      // },
      // formContent: {
      //   components: [
      //     {
      //       extTypeCheckbox: false,
      //       epgu_selected_vs: {},
      //       components: [
      //         {
      //           extTypeCheckbox: false,
      //           epgu_selected_vs: {},
      //           input: false,
      //           columns: [
      //             {
      //               pull: 0,
      //               components: [
      //                 {
      //                   extTypeCheckbox: false,
      //                   epgu_selected_vs: {},
      //                   input: true,
      //                   dataGridLabel: false,
      //                   hideOnChildrenHidden: false,
      //                   tableView: true,
      //                   smev_req: {},
      //                   require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                   disabled: true,
      //                   label: "Статус заявления",
      //                   type: "textfield",
      //                   key: "params_handler_state_string",
      //                 },
      //               ],
      //               offset: 0,
      //               size: "md",
      //               width: 6,
      //               push: 0,
      //             },
      //             {
      //               pull: 0,
      //               components: [
      //                 {
      //                   extTypeCheckbox: false,
      //                   epgu_selected_vs: {},
      //                   widget: {
      //                     minDate: null,
      //                     enableTime: true,
      //                     format: "dd-MM-yyyy",
      //                     displayInTimezone: "viewer",
      //                     noCalendar: false,
      //                     type: "calendar",
      //                     locale: "ru",
      //                     time_24hr: false,
      //                     allowInput: true,
      //                     minuteIncrement: 1,
      //                     mode: "single",
      //                     useLocaleSettings: false,
      //                     maxDate: null,
      //                     hourIncrement: 1,
      //                   },
      //                   dataGridLabel: false,
      //                   hideOnChildrenHidden: false,
      //                   format: "dd-MM-yyyy",
      //                   tableView: false,
      //                   require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                   label: "Дата подачи заявления",
      //                   type: "datetime",
      //                   input: true,
      //                   smev_req: {},
      //                   disabled: true,
      //                   key: "params_handler_application_start",
      //                 },
      //               ],
      //               offset: 0,
      //               size: "md",
      //               width: 6,
      //               push: 0,
      //             },
      //           ],
      //           dataGridLabel: false,
      //           smev_req: {},
      //           tableView: false,
      //           require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //           label: "Столбцы",
      //           type: "columns",
      //           key: "columns",
      //           esiaKey: {},
      //         },
      //         {
      //           extTypeCheckbox: false,
      //           epgu_selected_vs: {},
      //           input: false,
      //           columns: [
      //             {
      //               pull: 0,
      //               components: [
      //                 {
      //                   extTypeCheckbox: false,
      //                   epgu_selected_vs: {},
      //                   dataGridLabel: false,
      //                   hideOnChildrenHidden: false,
      //                   tableView: true,
      //                   require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                   label: "Номер заявления на ЕПГУ",
      //                   type: "textfield",
      //                   input: true,
      //                   smev_req: {},
      //                   disabled: true,
      //                   placeholder: "Личное обращение",
      //                   key: "Service.orderId",
      //                 },
      //               ],
      //               offset: 0,
      //               size: "md",
      //               width: 6,
      //               push: 0,
      //             },
      //             {
      //               pull: 0,
      //               components: [
      //                 {
      //                   extTypeCheckbox: false,
      //                   epgu_selected_vs: {},
      //                   input: true,
      //                   dataGridLabel: false,
      //                   hideOnChildrenHidden: false,
      //                   tableView: true,
      //                   smev_req: {},
      //                   require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                   disabled: true,
      //                   label: "Номер заявления",
      //                   type: "textfield",
      //                   key: "params_handler_application",
      //                 },
      //               ],
      //               offset: 0,
      //               size: "md",
      //               width: 6,
      //               push: 0,
      //             },
      //           ],
      //           dataGridLabel: false,
      //           smev_req: {},
      //           tableView: false,
      //           require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //           label: "Столбцы",
      //           type: "columns",
      //           key: "columns1",
      //           esiaKey: {},
      //         },
      //         {
      //           extTypeCheckbox: false,
      //           epgu_selected_vs: {},
      //           widget: "choicesjs",
      //           data: {
      //             values: [
      //               {
      //                 label: "Министерство промышленности и цифрового развития",
      //                 value: "министерствоПромышленностиИЦифровогоРазвития",
      //               },
      //               {
      //                 label: "Министерство образования и науки",
      //                 value: "министерствоОбразованияИНауки",
      //               },
      //             ],
      //             url: "https://demo.isands.ru/o/template/entity/undefined/?entityName=undefined&column=undefined&forSelect=true",
      //           },
      //           dataGridLabel: false,
      //           tableView: true,
      //           indexeddb: {
      //             filter: {},
      //             database: "",
      //             table: "",
      //           },
      //           require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //           label: "Уполномоченный орган",
      //           type: "select",
      //           reference: false,
      //           selectedDictColumn: {},
      //           input: true,
      //           isSelectDict: true,
      //           selectThreshold: 0.3,
      //           addResource: false,
      //           disableLimit: false,
      //           smev_req: {},
      //           key: "CompetentOrganization.Name",
      //           validate: {
      //             select: false,
      //           },
      //         },
      //         {
      //           extTypeCheckbox: false,
      //           epgu_selected_vs: {},
      //           input: true,
      //           defaultValue: false,
      //           tableView: false,
      //           smev_req: {},
      //           require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //           label: "Получить дополнительно результат на бумажном носителе",
      //           type: "checkbox",
      //           key: "MethodGettingResults.IsPaperDocumentRequired",
      //         },
      //         {
      //           extTypeCheckbox: false,
      //           epgu_selected_vs: {},
      //           widget: "choicesjs",
      //           hidden: true,
      //           data: {
      //             values: [
      //               {
      //                 label: "МФЦ",
      //                 value: "1",
      //               },
      //               {
      //                 label: "Личное обращение в уполномоченный орган",
      //                 value: "2",
      //               },
      //             ],
      //           },
      //           conditional: {
      //             show: true,
      //             eq: "true",
      //             when: "MethodGettingResults.IsPaperDocumentRequired",
      //           },
      //           dataGridLabel: false,
      //           tableView: true,
      //           indexeddb: {
      //             filter: {},
      //             database: "",
      //             table: "",
      //           },
      //           require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //           label: "Способ получения результата",
      //           type: "select",
      //           reference: false,
      //           selectedDictColumn: {},
      //           input: true,
      //           selectThreshold: 0.3,
      //           addResource: false,
      //           disableLimit: false,
      //           smev_req: {},
      //           key: "MethodGettingResults.FieldRadio",
      //           validate: {
      //             select: false,
      //           },
      //         },
      //         {
      //           extTypeCheckbox: false,
      //           epgu_selected_vs: {},
      //           input: true,
      //           dataGridLabel: false,
      //           tableView: true,
      //           smev_req: {},
      //           require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //           label: "Комментарий к заявлению",
      //           type: "textarea",
      //           autoExpand: false,
      //           isUploadEnabled: false,
      //           key: "comment",
      //         },
      //       ],
      //       collapsed: false,
      //       dataGridLabel: false,
      //       allowPrevious: false,
      //       tableView: false,
      //       require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //       label: "Меню",
      //       title: "Меню",
      //       type: "panel",
      //       breadcrumbClickable: true,
      //       collapsible: true,
      //       buttonSettings: {
      //         cancel: true,
      //         next: true,
      //         previous: true,
      //       },
      //       input: false,
      //       smev_req: {},
      //       theme: "info",
      //       key: "panel",
      //       esiaKey: {},
      //     },
      //     {
      //       extTypeCheckbox: false,
      //       epgu_selected_vs: {},
      //       components: [
      //         {
      //           extTypeCheckbox: false,
      //           epgu_selected_vs: {},
      //           widget: "choicesjs",
      //           data: {
      //             values: [
      //               {
      //                 label: "",
      //                 value: "",
      //               },
      //             ],
      //             url: "https://demo.isands.ru/o/template/entity/DictionaryPortletEndpoint/?entityName=DelegateInfo&column=DelegateInfo&forSelect=true",
      //           },
      //           dataGridLabel: false,
      //           tableView: true,
      //           indexeddb: {
      //             filter: {},
      //             database: "",
      //             table: "",
      //           },
      //           require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //           label: "Категория заявителя",
      //           type: "select",
      //           selectedDictCode: {
      //             endpoint: "DictionaryPortletEndpoint",
      //             columns: [
      //               {
      //                 name: "DelegateInfo",
      //                 label: "Категория заявителя",
      //                 type: "STRING",
      //                 value: "DelegateInfo",
      //               },
      //             ],
      //             name: "DelegateInfo",
      //             label: "Категория заявителя",
      //             value: "DelegateInfo",
      //           },
      //           valueProperty: "value",
      //           reference: false,
      //           selectedDictColumn: {
      //             name: "DelegateInfo",
      //             label: "Категория заявителя",
      //             type: "STRING",
      //             value: "DelegateInfo",
      //           },
      //           input: true,
      //           idPath: "value",
      //           isSelectDict: true,
      //           selectThreshold: 0.3,
      //           addResource: false,
      //           disableLimit: false,
      //           smev_req: {},
      //           key: "DelegateInfo",
      //           dataSrc: "url",
      //           validate: {
      //             select: false,
      //             required: true,
      //           },
      //         },
      //         {
      //           extTypeCheckbox: false,
      //           epgu_selected_vs: {},
      //           components: [
      //             {
      //               extTypeCheckbox: false,
      //               epgu_selected_vs: {},
      //               input: false,
      //               columns: [
      //                 {
      //                   pull: 0,
      //                   components: [
      //                     {
      //                       extTypeCheckbox: false,
      //                       epgu_selected_vs: {},
      //                       input: true,
      //                       dataGridLabel: false,
      //                       hideOnChildrenHidden: false,
      //                       tableView: true,
      //                       smev_req: {},
      //                       require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                       label: "Фамилия",
      //                       type: "textfield",
      //                       key: "Surname",
      //                     },
      //                   ],
      //                   offset: 0,
      //                   size: "md",
      //                   width: 4,
      //                   push: 0,
      //                 },
      //                 {
      //                   pull: 0,
      //                   components: [
      //                     {
      //                       extTypeCheckbox: false,
      //                       epgu_selected_vs: {},
      //                       input: true,
      //                       dataGridLabel: false,
      //                       hideOnChildrenHidden: false,
      //                       tableView: true,
      //                       smev_req: {},
      //                       require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                       label: "Имя",
      //                       type: "textfield",
      //                       key: "FirstName",
      //                     },
      //                   ],
      //                   offset: 0,
      //                   size: "md",
      //                   width: 4,
      //                   push: 0,
      //                 },
      //                 {
      //                   pull: 0,
      //                   components: [
      //                     {
      //                       extTypeCheckbox: false,
      //                       epgu_selected_vs: {},
      //                       input: true,
      //                       dataGridLabel: false,
      //                       hideOnChildrenHidden: false,
      //                       tableView: true,
      //                       smev_req: {},
      //                       require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                       label: "Отчество",
      //                       type: "textfield",
      //                       key: "Middlename",
      //                     },
      //                   ],
      //                   size: "md",
      //                   offset: 0,
      //                   width: 4,
      //                   push: 0,
      //                 },
      //               ],
      //               dataGridLabel: false,
      //               smev_req: {},
      //               tableView: false,
      //               require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //               label: "Столбцы",
      //               type: "columns",
      //               key: "columns2",
      //               esiaKey: {},
      //             },
      //             {
      //               extTypeCheckbox: false,
      //               epgu_selected_vs: {},
      //               input: false,
      //               columns: [
      //                 {
      //                   pull: 0,
      //                   components: [
      //                     {
      //                       extTypeCheckbox: false,
      //                       epgu_selected_vs: {},
      //                       widget: {
      //                         minDate: null,
      //                         enableTime: true,
      //                         format: "dd-MM-yyyy",
      //                         displayInTimezone: "viewer",
      //                         noCalendar: false,
      //                         type: "calendar",
      //                         locale: "ru",
      //                         time_24hr: false,
      //                         allowInput: true,
      //                         minuteIncrement: 1,
      //                         mode: "single",
      //                         useLocaleSettings: false,
      //                         maxDate: null,
      //                         hourIncrement: 1,
      //                       },
      //                       dataGridLabel: false,
      //                       hideOnChildrenHidden: false,
      //                       format: "dd-MM-yyyy",
      //                       tableView: false,
      //                       require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                       label: "Дата рождения",
      //                       type: "datetime",
      //                       input: true,
      //                       smev_req: {},
      //                       key: "dateTime1",
      //                     },
      //                   ],
      //                   offset: 0,
      //                   size: "md",
      //                   width: 4,
      //                   push: 0,
      //                 },
      //                 {
      //                   pull: 0,
      //                   components: [
      //                     {
      //                       extTypeCheckbox: false,
      //                       epgu_selected_vs: {},
      //                       input: true,
      //                       dataGridLabel: false,
      //                       hideOnChildrenHidden: false,
      //                       tableView: true,
      //                       smev_req: {},
      //                       require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                       label: "Гражданство",
      //                       type: "textfield",
      //                       key: "textField4",
      //                     },
      //                   ],
      //                   offset: 0,
      //                   size: "md",
      //                   width: 4,
      //                   push: 0,
      //                 },
      //                 {
      //                   pull: 0,
      //                   components: [
      //                     {
      //                       extTypeCheckbox: false,
      //                       epgu_selected_vs: {},
      //                       input: true,
      //                       dataGridLabel: false,
      //                       hideOnChildrenHidden: false,
      //                       tableView: true,
      //                       smev_req: {},
      //                       require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                       label: "СНИЛС",
      //                       inputMask: "999-999-999 99",
      //                       type: "textfield",
      //                       key: "textField5",
      //                     },
      //                   ],
      //                   size: "md",
      //                   offset: 0,
      //                   width: 4,
      //                   push: 0,
      //                 },
      //               ],
      //               dataGridLabel: false,
      //               smev_req: {},
      //               tableView: false,
      //               require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //               label: "Столбцы",
      //               type: "columns",
      //               key: "columns3",
      //               esiaKey: {},
      //             },
      //             {
      //               extTypeCheckbox: false,
      //               epgu_selected_vs: {},
      //               input: false,
      //               columns: [
      //                 {
      //                   pull: 0,
      //                   components: [],
      //                   offset: 0,
      //                   size: "md",
      //                   width: 4,
      //                   push: 0,
      //                 },
      //                 {
      //                   pull: 0,
      //                   components: [
      //                     {
      //                       extTypeCheckbox: false,
      //                       epgu_selected_vs: {},
      //                       input: true,
      //                       dataGridLabel: false,
      //                       hideOnChildrenHidden: false,
      //                       tableView: true,
      //                       smev_req: {},
      //                       require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                       label: "Телефон",
      //                       inputMask: "9 (999) 999-9999",
      //                       type: "phoneNumber",
      //                       key: "phoneNumber1",
      //                     },
      //                   ],
      //                   offset: 0,
      //                   size: "md",
      //                   width: 4,
      //                   push: 0,
      //                 },
      //                 {
      //                   pull: 0,
      //                   components: [
      //                     {
      //                       extTypeCheckbox: false,
      //                       epgu_selected_vs: {},
      //                       input: true,
      //                       dataGridLabel: false,
      //                       hideOnChildrenHidden: false,
      //                       tableView: true,
      //                       smev_req: {},
      //                       require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                       label: "Электронная почта",
      //                       type: "email",
      //                       key: "email",
      //                     },
      //                   ],
      //                   size: "md",
      //                   offset: 0,
      //                   width: 4,
      //                   push: 0,
      //                 },
      //               ],
      //               dataGridLabel: false,
      //               smev_req: {},
      //               tableView: false,
      //               require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //               label: "Столбцы",
      //               type: "columns",
      //               key: "columns4",
      //               esiaKey: {},
      //             },
      //           ],
      //           hidden: true,
      //           conditional: {
      //             show: true,
      //             eq: "1",
      //             when: "DelegateInfo",
      //           },
      //           collapsed: false,
      //           dataGridLabel: false,
      //           allowPrevious: false,
      //           tableView: false,
      //           require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //           label: "Данные о заявителе",
      //           title: "Данные о заявителе",
      //           type: "panel",
      //           breadcrumbClickable: true,
      //           collapsible: true,
      //           buttonSettings: {
      //             cancel: true,
      //             next: true,
      //             previous: true,
      //           },
      //           input: false,
      //           smev_req: {},
      //           theme: "info",
      //           key: "panel2",
      //           esiaKey: {},
      //         },
      //         {
      //           extTypeCheckbox: false,
      //           epgu_selected_vs: {},
      //           components: [
      //             {
      //               extTypeCheckbox: false,
      //               epgu_selected_vs: {},
      //               input: false,
      //               columns: [
      //                 {
      //                   pull: 0,
      //                   components: [
      //                     {
      //                       extTypeCheckbox: false,
      //                       epgu_selected_vs: {},
      //                       input: true,
      //                       dataGridLabel: false,
      //                       hideOnChildrenHidden: false,
      //                       tableView: true,
      //                       smev_req: {},
      //                       require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                       label: "Фамилия",
      //                       type: "textfield",
      //                       key: "textField1",
      //                     },
      //                   ],
      //                   offset: 0,
      //                   size: "md",
      //                   width: 4,
      //                   push: 0,
      //                 },
      //                 {
      //                   pull: 0,
      //                   components: [
      //                     {
      //                       extTypeCheckbox: false,
      //                       epgu_selected_vs: {},
      //                       input: true,
      //                       dataGridLabel: false,
      //                       hideOnChildrenHidden: false,
      //                       tableView: true,
      //                       smev_req: {},
      //                       require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                       label: "Имя",
      //                       type: "textfield",
      //                       key: "textField6",
      //                     },
      //                   ],
      //                   offset: 0,
      //                   size: "md",
      //                   width: 4,
      //                   push: 0,
      //                 },
      //                 {
      //                   pull: 0,
      //                   components: [
      //                     {
      //                       extTypeCheckbox: false,
      //                       epgu_selected_vs: {},
      //                       input: true,
      //                       dataGridLabel: false,
      //                       hideOnChildrenHidden: false,
      //                       tableView: true,
      //                       smev_req: {},
      //                       require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                       label: "Отчество",
      //                       type: "textfield",
      //                       key: "textField7",
      //                     },
      //                   ],
      //                   size: "md",
      //                   offset: 0,
      //                   width: 4,
      //                   push: 0,
      //                 },
      //               ],
      //               dataGridLabel: false,
      //               smev_req: {},
      //               tableView: false,
      //               require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //               label: "Столбцы",
      //               type: "columns",
      //               key: "columns5",
      //               esiaKey: {},
      //             },
      //             {
      //               extTypeCheckbox: false,
      //               epgu_selected_vs: {},
      //               input: false,
      //               columns: [
      //                 {
      //                   pull: 0,
      //                   components: [
      //                     {
      //                       extTypeCheckbox: false,
      //                       epgu_selected_vs: {},
      //                       widget: {
      //                         minDate: null,
      //                         enableTime: true,
      //                         format: "dd-MM-yyyy",
      //                         displayInTimezone: "viewer",
      //                         noCalendar: false,
      //                         type: "calendar",
      //                         locale: "ru",
      //                         time_24hr: false,
      //                         allowInput: true,
      //                         minuteIncrement: 1,
      //                         mode: "single",
      //                         useLocaleSettings: false,
      //                         maxDate: null,
      //                         hourIncrement: 1,
      //                       },
      //                       dataGridLabel: false,
      //                       hideOnChildrenHidden: false,
      //                       format: "dd-MM-yyyy",
      //                       tableView: false,
      //                       require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                       label: "Дата рождения",
      //                       type: "datetime",
      //                       input: true,
      //                       smev_req: {},
      //                       key: "dateTime2",
      //                     },
      //                   ],
      //                   offset: 0,
      //                   size: "md",
      //                   width: 4,
      //                   push: 0,
      //                 },
      //                 {
      //                   pull: 0,
      //                   components: [
      //                     {
      //                       extTypeCheckbox: false,
      //                       epgu_selected_vs: {},
      //                       input: true,
      //                       dataGridLabel: false,
      //                       hideOnChildrenHidden: false,
      //                       tableView: true,
      //                       smev_req: {},
      //                       require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                       label: "Гражданство",
      //                       type: "textfield",
      //                       key: "textField8",
      //                     },
      //                   ],
      //                   offset: 0,
      //                   size: "md",
      //                   width: 4,
      //                   push: 0,
      //                 },
      //                 {
      //                   pull: 0,
      //                   components: [
      //                     {
      //                       extTypeCheckbox: false,
      //                       epgu_selected_vs: {},
      //                       input: true,
      //                       dataGridLabel: false,
      //                       hideOnChildrenHidden: false,
      //                       tableView: true,
      //                       smev_req: {},
      //                       require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                       label: "СНИЛС",
      //                       inputMask: "999-999-999 99",
      //                       type: "textfield",
      //                       key: "textField9",
      //                     },
      //                   ],
      //                   size: "md",
      //                   offset: 0,
      //                   width: 4,
      //                   push: 0,
      //                 },
      //               ],
      //               dataGridLabel: false,
      //               smev_req: {},
      //               tableView: false,
      //               require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //               label: "Столбцы",
      //               type: "columns",
      //               key: "columns6",
      //               esiaKey: {},
      //             },
      //             {
      //               extTypeCheckbox: false,
      //               epgu_selected_vs: {},
      //               input: false,
      //               columns: [
      //                 {
      //                   pull: 0,
      //                   components: [
      //                     {
      //                       extTypeCheckbox: false,
      //                       epgu_selected_vs: {},
      //                       widget: "choicesjs",
      //                       data: {
      //                         values: [
      //                           {
      //                             label: "Мужской",
      //                             value: "1",
      //                           },
      //                           {
      //                             label: "Женский",
      //                             value: "2",
      //                           },
      //                         ],
      //                         url: "https://demo.isands.ru/o/template/entity/DictionaryPortletEndpoint/?entityName=7895&column=7895&forSelect=true",
      //                       },
      //                       dataGridLabel: false,
      //                       hideOnChildrenHidden: false,
      //                       tableView: true,
      //                       indexeddb: {
      //                         filter: {},
      //                         database: "",
      //                         table: "",
      //                       },
      //                       require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                       label: "Пол",
      //                       type: "select",
      //                       selectedDictCode: {
      //                         endpoint: "DictionaryPortletEndpoint",
      //                         columns: [
      //                           {
      //                             name: "7895",
      //                             label: "floor (пол)",
      //                             type: "STRING",
      //                             value: "7895",
      //                           },
      //                         ],
      //                         name: "7895",
      //                         label: "floor (пол)",
      //                         value: "7895",
      //                       },
      //                       reference: false,
      //                       selectedDictColumn: {
      //                         name: "7895",
      //                         label: "floor (пол)",
      //                         type: "STRING",
      //                         value: "7895",
      //                       },
      //                       input: true,
      //                       selectThreshold: 0.3,
      //                       addResource: false,
      //                       disableLimit: false,
      //                       smev_req: {},
      //                       key: "select2",
      //                       validate: {
      //                         select: false,
      //                       },
      //                     },
      //                   ],
      //                   offset: 0,
      //                   size: "md",
      //                   width: 4,
      //                   push: 0,
      //                 },
      //                 {
      //                   pull: 0,
      //                   components: [
      //                     {
      //                       extTypeCheckbox: false,
      //                       epgu_selected_vs: {},
      //                       input: true,
      //                       dataGridLabel: false,
      //                       hideOnChildrenHidden: false,
      //                       tableView: true,
      //                       smev_req: {},
      //                       require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                       label: "Телефон",
      //                       inputMask: "9 (999) 999-9999",
      //                       type: "phoneNumber",
      //                       key: "phoneNumber2",
      //                     },
      //                   ],
      //                   offset: 0,
      //                   size: "md",
      //                   width: 4,
      //                   push: 0,
      //                 },
      //                 {
      //                   pull: 0,
      //                   components: [
      //                     {
      //                       extTypeCheckbox: false,
      //                       epgu_selected_vs: {},
      //                       input: true,
      //                       dataGridLabel: false,
      //                       hideOnChildrenHidden: false,
      //                       tableView: true,
      //                       smev_req: {},
      //                       require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                       label: "Электронная почта",
      //                       type: "email",
      //                       key: "email1",
      //                     },
      //                   ],
      //                   size: "md",
      //                   offset: 0,
      //                   width: 4,
      //                   push: 0,
      //                 },
      //               ],
      //               dataGridLabel: false,
      //               smev_req: {},
      //               tableView: false,
      //               require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //               label: "Столбцы",
      //               type: "columns",
      //               key: "columns7",
      //               esiaKey: {},
      //             },
      //           ],
      //           hidden: true,
      //           conditional: {
      //             show: true,
      //             eq: "2",
      //             when: "DelegateInfo",
      //           },
      //           collapsed: false,
      //           dataGridLabel: false,
      //           allowPrevious: false,
      //           tableView: false,
      //           require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //           label: "Данные о представителе заявителя",
      //           title: "Данные о представителе заявителя",
      //           type: "panel",
      //           breadcrumbClickable: true,
      //           collapsible: true,
      //           buttonSettings: {
      //             cancel: true,
      //             next: true,
      //             previous: true,
      //           },
      //           input: false,
      //           smev_req: {},
      //           theme: "info",
      //           key: "panel4",
      //           esiaKey: {},
      //         },
      //         {
      //           extTypeCheckbox: false,
      //           epgu_selected_vs: {},
      //           components: [
      //             {
      //               extTypeCheckbox: false,
      //               epgu_selected_vs: {},
      //               widget: "choicesjs",
      //               data: {
      //                 values: [
      //                   {
      //                     label: "Паспорт гражданина Российской Федерации",
      //                     value: "1",
      //                   },
      //                   {
      //                     label: "Удостоверение личности лица без гражданства",
      //                     value: "2",
      //                   },
      //                   {
      //                     label: "Паспорт иностранного гражданина",
      //                     value: "3",
      //                   },
      //                 ],
      //                 url: "https://demo.isands.ru/o/template/entity/undefined/?entityName=undefined&column=undefined&forSelect=true",
      //               },
      //               dataGridLabel: false,
      //               tableView: true,
      //               indexeddb: {
      //                 filter: {},
      //                 database: "",
      //                 table: "",
      //               },
      //               require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //               label: "Наименование документа",
      //               type: "select",
      //               reference: false,
      //               selectedDictColumn: {},
      //               input: true,
      //               selectThreshold: 0.3,
      //               addResource: false,
      //               disableLimit: false,
      //               smev_req: {},
      //               key: "select3",
      //               validate: {
      //                 select: false,
      //               },
      //             },
      //             {
      //               extTypeCheckbox: false,
      //               epgu_selected_vs: {},
      //               input: false,
      //               columns: [
      //                 {
      //                   pull: 0,
      //                   components: [
      //                     {
      //                       extTypeCheckbox: false,
      //                       epgu_selected_vs: {},
      //                       input: true,
      //                       dataGridLabel: false,
      //                       hideOnChildrenHidden: false,
      //                       tableView: true,
      //                       smev_req: {},
      //                       require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                       label: "Серия",
      //                       type: "textfield",
      //                       key: "textField11",
      //                     },
      //                   ],
      //                   offset: 0,
      //                   size: "md",
      //                   width: 3,
      //                   push: 0,
      //                 },
      //                 {
      //                   pull: 0,
      //                   components: [
      //                     {
      //                       extTypeCheckbox: false,
      //                       epgu_selected_vs: {},
      //                       input: true,
      //                       dataGridLabel: false,
      //                       hideOnChildrenHidden: false,
      //                       tableView: true,
      //                       smev_req: {},
      //                       require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                       label: "Номер",
      //                       type: "textfield",
      //                       key: "textField12",
      //                     },
      //                   ],
      //                   offset: 0,
      //                   size: "md",
      //                   width: 3,
      //                   push: 0,
      //                 },
      //                 {
      //                   pull: 0,
      //                   components: [
      //                     {
      //                       extTypeCheckbox: false,
      //                       epgu_selected_vs: {},
      //                       widget: {
      //                         minDate: null,
      //                         enableTime: true,
      //                         format: "dd-MM-yyyy",
      //                         displayInTimezone: "viewer",
      //                         noCalendar: false,
      //                         type: "calendar",
      //                         locale: "ru",
      //                         time_24hr: false,
      //                         allowInput: true,
      //                         minuteIncrement: 1,
      //                         mode: "single",
      //                         useLocaleSettings: false,
      //                         maxDate: null,
      //                         hourIncrement: 1,
      //                       },
      //                       dataGridLabel: false,
      //                       hideOnChildrenHidden: false,
      //                       format: "dd-MM-yyyy",
      //                       tableView: false,
      //                       require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                       label: "Дата выдачи",
      //                       type: "datetime",
      //                       input: true,
      //                       smev_req: {},
      //                       key: "dateTime3",
      //                     },
      //                   ],
      //                   size: "md",
      //                   offset: 0,
      //                   width: 3,
      //                   push: 0,
      //                 },
      //                 {
      //                   pull: 0,
      //                   components: [
      //                     {
      //                       extTypeCheckbox: false,
      //                       epgu_selected_vs: {},
      //                       widget: {
      //                         minDate: null,
      //                         enableTime: true,
      //                         format: "dd-MM-yyyy",
      //                         displayInTimezone: "viewer",
      //                         noCalendar: false,
      //                         type: "calendar",
      //                         locale: "ru",
      //                         time_24hr: false,
      //                         allowInput: true,
      //                         minuteIncrement: 1,
      //                         mode: "single",
      //                         useLocaleSettings: false,
      //                         maxDate: null,
      //                         hourIncrement: 1,
      //                       },
      //                       dataGridLabel: false,
      //                       hideOnChildrenHidden: false,
      //                       format: "dd-MM-yyyy",
      //                       tableView: false,
      //                       require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                       label: "Срок действия",
      //                       type: "datetime",
      //                       input: true,
      //                       smev_req: {},
      //                       key: "dateTime4",
      //                     },
      //                   ],
      //                   size: "md",
      //                   offset: 0,
      //                   width: 3,
      //                   push: 0,
      //                 },
      //               ],
      //               dataGridLabel: false,
      //               smev_req: {},
      //               tableView: false,
      //               require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //               label: "Столбцы",
      //               type: "columns",
      //               key: "columns8",
      //               esiaKey: {},
      //             },
      //             {
      //               extTypeCheckbox: false,
      //               epgu_selected_vs: {},
      //               input: false,
      //               columns: [
      //                 {
      //                   pull: 0,
      //                   components: [
      //                     {
      //                       extTypeCheckbox: false,
      //                       epgu_selected_vs: {},
      //                       input: true,
      //                       dataGridLabel: false,
      //                       hideOnChildrenHidden: false,
      //                       tableView: true,
      //                       smev_req: {},
      //                       require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                       label: "Кем выдан",
      //                       type: "textfield",
      //                       key: "textField13",
      //                     },
      //                   ],
      //                   offset: 0,
      //                   size: "md",
      //                   width: 6,
      //                   push: 0,
      //                 },
      //                 {
      //                   pull: 0,
      //                   components: [
      //                     {
      //                       extTypeCheckbox: false,
      //                       epgu_selected_vs: {},
      //                       input: true,
      //                       dataGridLabel: false,
      //                       hideOnChildrenHidden: false,
      //                       tableView: true,
      //                       smev_req: {},
      //                       require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                       label: "Код подразделения",
      //                       type: "textfield",
      //                       key: "textField14",
      //                     },
      //                   ],
      //                   offset: 0,
      //                   size: "md",
      //                   width: 6,
      //                   push: 0,
      //                 },
      //               ],
      //               dataGridLabel: false,
      //               smev_req: {},
      //               tableView: false,
      //               require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //               label: "Столбцы",
      //               type: "columns",
      //               key: "columns9",
      //               esiaKey: {},
      //             },
      //           ],
      //           collapsed: false,
      //           dataGridLabel: false,
      //           allowPrevious: false,
      //           tableView: false,
      //           require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //           label: "Документ, удостоверяющий личность",
      //           title: "Документ, удостоверяющий личность",
      //           type: "panel",
      //           breadcrumbClickable: true,
      //           collapsible: true,
      //           buttonSettings: {
      //             cancel: true,
      //             next: true,
      //             previous: true,
      //           },
      //           input: false,
      //           smev_req: {},
      //           theme: "info",
      //           key: "panel3",
      //           esiaKey: {},
      //         },
      //       ],
      //       legend: "Сведения о заявителе/представителе заявителя",
      //       dataGridLabel: false,
      //       tableView: false,
      //       require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //       label: "Сведения о заявителе/представителе заявителя",
      //       type: "fieldset",
      //       input: false,
      //       smev_req: {},
      //       key: "fieldSet3",
      //       esiaKey: {},
      //     },
      //     {
      //       extTypeCheckbox: false,
      //       epgu_selected_vs: {},
      //       components: [
      //         {
      //           extTypeCheckbox: false,
      //           epgu_selected_vs: {},
      //           widget: "choicesjs",
      //           data: {
      //             values: [
      //               {
      //                 label: "Первая квалификационная категория",
      //                 value: "1",
      //               },
      //               {
      //                 label: "Высшая квалификационная категория",
      //                 value: "2",
      //               },
      //             ],
      //           },
      //           dataGridLabel: false,
      //           tableView: true,
      //           indexeddb: {
      //             filter: {},
      //             database: "",
      //             table: "",
      //           },
      //           require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //           label:
      //             "На какую квалификационную категорию претендует заявитель?",
      //           type: "select",
      //           reference: false,
      //           selectedDictColumn: {},
      //           input: true,
      //           selectThreshold: 0.3,
      //           addResource: false,
      //           disableLimit: false,
      //           smev_req: {},
      //           key: "KP_APR_03",
      //           validate: {
      //             select: false,
      //           },
      //         },
      //         {
      //           extTypeCheckbox: false,
      //           epgu_selected_vs: {},
      //           widget: "choicesjs",
      //           hidden: true,
      //           data: {
      //             values: [
      //               {
      //                 label: "Квалификационная категория не установлена",
      //                 value: "1",
      //               },
      //               {
      //                 label: "Квалификационная категория установлена",
      //                 value: "2",
      //               },
      //             ],
      //           },
      //           conditional: {
      //             show: true,
      //             eq: "1",
      //             when: "KP_APR_03",
      //           },
      //           dataGridLabel: false,
      //           tableView: true,
      //           indexeddb: {
      //             filter: {},
      //             database: "",
      //             table: "",
      //           },
      //           require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //           label: "Квалификационная категория установлена?",
      //           type: "select",
      //           reference: false,
      //           selectedDictColumn: {},
      //           input: true,
      //           selectThreshold: 0.3,
      //           addResource: false,
      //           disableLimit: false,
      //           smev_req: {},
      //           key: "VariantChoiceT.KP_APR_04",
      //           validate: {
      //             select: false,
      //           },
      //         },
      //         {
      //           extTypeCheckbox: false,
      //           epgu_selected_vs: {},
      //           widget: "choicesjs",
      //           hidden: true,
      //           data: {
      //             values: [
      //               {
      //                 label: "Аттестация ранее не проводилась",
      //                 value: "1",
      //               },
      //               {
      //                 label: "Аттестация проводилась",
      //                 value: "2",
      //               },
      //             ],
      //           },
      //           conditional: {
      //             show: true,
      //             eq: "1",
      //             when: "KP_APR_03",
      //           },
      //           dataGridLabel: false,
      //           tableView: true,
      //           indexeddb: {
      //             filter: {},
      //             database: "",
      //             table: "",
      //           },
      //           require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //           label: "Аттестация ранее проводилась?",
      //           type: "select",
      //           reference: false,
      //           selectedDictColumn: {},
      //           input: true,
      //           selectThreshold: 0.3,
      //           addResource: false,
      //           disableLimit: false,
      //           smev_req: {},
      //           key: "VariantChoice.KP_APR_05",
      //           validate: {
      //             select: false,
      //           },
      //         },
      //         {
      //           extTypeCheckbox: false,
      //           epgu_selected_vs: {},
      //           widget: "choicesjs",
      //           data: {
      //             values: [
      //               {
      //                 label: "Заявитель повышал квалификацию",
      //                 value: "1",
      //               },
      //               {
      //                 label: "Заявитель не повышал квалификацию",
      //                 value: "2",
      //               },
      //             ],
      //           },
      //           dataGridLabel: false,
      //           tableView: true,
      //           indexeddb: {
      //             filter: {},
      //             database: "",
      //             table: "",
      //           },
      //           require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //           label: "Заявитель повышал квалификацию?",
      //           type: "select",
      //           reference: false,
      //           selectedDictColumn: {},
      //           input: true,
      //           selectThreshold: 0.3,
      //           addResource: false,
      //           disableLimit: false,
      //           smev_req: {},
      //           key: "VariantChoice.KP_APR_06",
      //           validate: {
      //             select: false,
      //             required: true,
      //           },
      //         },
      //         {
      //           extTypeCheckbox: false,
      //           epgu_selected_vs: {},
      //           components: [
      //             {
      //               extTypeCheckbox: false,
      //               epgu_selected_vs: {},
      //               input: false,
      //               columns: [
      //                 {
      //                   pull: 0,
      //                   components: [],
      //                   offset: 0,
      //                   size: "md",
      //                   width: 6,
      //                   push: 0,
      //                 },
      //                 {
      //                   pull: 0,
      //                   components: [],
      //                   offset: 0,
      //                   size: "md",
      //                   width: 6,
      //                   push: 0,
      //                 },
      //               ],
      //               dataGridLabel: false,
      //               smev_req: {},
      //               tableView: false,
      //               require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //               label: "Столбцы",
      //               type: "columns",
      //               key: "columns10",
      //               esiaKey: {},
      //             },
      //           ],
      //           hidden: true,
      //           conditional: {
      //             show: true,
      //             eq: "1",
      //             when: "VariantChoice.KP_APR_06",
      //           },
      //           collapsed: false,
      //           dataGridLabel: false,
      //           allowPrevious: false,
      //           tableView: false,
      //           require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //           label: "Сведения о повышении квалификации",
      //           title: "Сведения о повышении квалификации",
      //           type: "panel",
      //           breadcrumbClickable: true,
      //           collapsible: true,
      //           buttonSettings: {
      //             cancel: true,
      //             next: true,
      //             previous: true,
      //           },
      //           input: false,
      //           smev_req: {},
      //           theme: "info",
      //           key: "panel11",
      //           esiaKey: {},
      //         },
      //         {
      //           extTypeCheckbox: false,
      //           epgu_selected_vs: {},
      //           widget: "choicesjs",
      //           data: {
      //             values: [
      //               {
      //                 label: "Имеет",
      //                 value: "1",
      //               },
      //               {
      //                 label: "Не имеет",
      //                 value: "2",
      //               },
      //             ],
      //           },
      //           dataGridLabel: false,
      //           tableView: true,
      //           indexeddb: {
      //             filter: {},
      //             database: "",
      //             table: "",
      //           },
      //           require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //           label: "Заявитель имеет награды, звания, ученые степени?",
      //           type: "select",
      //           reference: false,
      //           selectedDictColumn: {},
      //           input: true,
      //           selectThreshold: 0.3,
      //           addResource: false,
      //           disableLimit: false,
      //           smev_req: {},
      //           key: "VariantChoice.KP_APR_07",
      //           validate: {
      //             select: false,
      //             required: true,
      //           },
      //         },
      //         {
      //           extTypeCheckbox: false,
      //           epgu_selected_vs: {},
      //           components: [
      //             {
      //               extTypeCheckbox: false,
      //               epgu_selected_vs: {},
      //               components: [
      //                 {
      //                   extTypeCheckbox: false,
      //                   epgu_selected_vs: {},
      //                   input: false,
      //                   components: [
      //                     {
      //                       extTypeCheckbox: false,
      //                       epgu_selected_vs: {},
      //                       input: true,
      //                       dataGridLabel: false,
      //                       tableView: true,
      //                       smev_req: {},
      //                       require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                       label:
      //                         "Наименование награды, звания, ученой степени, ученого звания ",
      //                       type: "textfield",
      //                       key: "textField28",
      //                       validate: {
      //                         required: true,
      //                       },
      //                     },
      //                     {
      //                       hideInputLabels: false,
      //                       extTypeCheckbox: false,
      //                       epgu_selected_vs: {},
      //                       defaultValue: "00/00/0000",
      //                       dataGridLabel: false,
      //                       tableView: false,
      //                       require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                       label: "Год получения",
      //                       type: "day",
      //                       useLocaleSettings: false,
      //                       input: true,
      //                       inputsLabelPosition: "top",
      //                       smev_req: {},
      //                       fields: {
      //                         month: {
      //                           hide: true,
      //                         },
      //                         year: {
      //                           hide: false,
      //                         },
      //                         day: {
      //                           hide: true,
      //                         },
      //                       },
      //                       key: "day2",
      //                       hideLabel: true,
      //                     },
      //                   ],
      //                   dataGridLabel: false,
      //                   smev_req: {},
      //                   tableView: false,
      //                   require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                   label: "",
      //                   type: "fieldset",
      //                   key: "fieldSet1",
      //                   esiaKey: {},
      //                 },
      //               ],
      //               enableRowGroups: false,
      //               defaultValue: [{}],
      //               dataGridLabel: false,
      //               tableView: false,
      //               reorder: false,
      //               require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //               label: "Сведения о заслугах ",
      //               layoutFixed: false,
      //               type: "datagrid",
      //               initEmpty: false,
      //               input: true,
      //               groupToggle: false,
      //               defaultOpen: false,
      //               smev_req: {},
      //               addAnotherPosition: "bottom",
      //               key: "dataGrid1",
      //               hideLabel: true,
      //             },
      //           ],
      //           hidden: true,
      //           conditional: {
      //             show: true,
      //             eq: "1",
      //             when: "VariantChoice.KP_APR_07",
      //           },
      //           collapsed: false,
      //           dataGridLabel: false,
      //           allowPrevious: false,
      //           tableView: false,
      //           require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //           label: "Сведения о заслугах",
      //           title: "Сведения о заслугах",
      //           type: "panel",
      //           breadcrumbClickable: true,
      //           collapsible: true,
      //           buttonSettings: {
      //             cancel: true,
      //             next: true,
      //             previous: true,
      //           },
      //           input: false,
      //           smev_req: {},
      //           theme: "info",
      //           key: "panel10",
      //           esiaKey: {},
      //         },
      //         {
      //           extTypeCheckbox: false,
      //           epgu_selected_vs: {},
      //           widget: "choicesjs",
      //           data: {
      //             values: [
      //               {
      //                 label: "Не изменялись",
      //                 value: "1",
      //               },
      //               {
      //                 label: "Изменялись",
      //                 value: "2",
      //               },
      //             ],
      //           },
      //           dataGridLabel: false,
      //           tableView: true,
      //           indexeddb: {
      //             filter: {},
      //             database: "",
      //             table: "",
      //           },
      //           require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //           label: "Изменялись фамилия, имя, отчество заявителя?",
      //           type: "select",
      //           reference: false,
      //           selectedDictColumn: {},
      //           input: true,
      //           selectThreshold: 0.3,
      //           addResource: false,
      //           disableLimit: false,
      //           smev_req: {},
      //           key: "VariantChoice.KP_APR_08",
      //           validate: {
      //             select: false,
      //             required: true,
      //           },
      //         },
      //         {
      //           extTypeCheckbox: false,
      //           epgu_selected_vs: {},
      //           components: [
      //             {
      //               extTypeCheckbox: false,
      //               epgu_selected_vs: {},
      //               input: true,
      //               defaultValue: false,
      //               tableView: false,
      //               smev_req: {},
      //               require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //               label: "Расторжение брака",
      //               type: "checkbox",
      //               key: "VariantChoice.KP_APR_09.Divorce",
      //             },
      //             {
      //               extTypeCheckbox: false,
      //               epgu_selected_vs: {},
      //               input: true,
      //               defaultValue: false,
      //               tableView: false,
      //               smev_req: {},
      //               require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //               label: "Иные причины",
      //               type: "checkbox",
      //               key: "VariantChoice.KP_APR_09OtherReasons",
      //             },
      //             {
      //               extTypeCheckbox: false,
      //               epgu_selected_vs: {},
      //               hidden: true,
      //               conditional: {
      //                 show: true,
      //                 eq: "true",
      //                 when: "VariantChoice.KP_APR_09OtherReasons",
      //               },
      //               dataGridLabel: false,
      //               tableView: true,
      //               require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //               label: "Иные причины",
      //               type: "textfield",
      //               input: true,
      //               smev_req: {},
      //               key: "textField42",
      //               customConditional:
      //                 "show = data.VariantChoice.KP_APR_09.OtherReasons === true",
      //             },
      //           ],
      //           hidden: true,
      //           conditional: {
      //             show: true,
      //             eq: "2",
      //             when: "VariantChoice.KP_APR_08",
      //           },
      //           collapsed: false,
      //           dataGridLabel: false,
      //           allowPrevious: false,
      //           tableView: false,
      //           require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //           label: "С чем связано изменение фамилии, имени и отчества?",
      //           title: "С чем связано изменение фамилии, имени и отчества?",
      //           type: "panel",
      //           breadcrumbClickable: true,
      //           collapsible: true,
      //           buttonSettings: {
      //             cancel: true,
      //             next: true,
      //             previous: true,
      //           },
      //           input: false,
      //           smev_req: {},
      //           theme: "info",
      //           key: "VariantChoice.KP_APR_09",
      //           esiaKey: {},
      //         },
      //         {
      //           extTypeCheckbox: false,
      //           epgu_selected_vs: {},
      //           widget: "choicesjs",
      //           data: {
      //             values: [
      //               {
      //                 label: "Будет принимать участие",
      //                 value: "1",
      //               },
      //               {
      //                 label: "Не будет принимать участие",
      //                 value: "2",
      //               },
      //             ],
      //           },
      //           dataGridLabel: false,
      //           tableView: true,
      //           indexeddb: {
      //             filter: {},
      //             database: "",
      //             table: "",
      //           },
      //           require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //           label:
      //             "Заявитель будет принимать участие в заседании аттестационной комиссии?",
      //           type: "select",
      //           reference: false,
      //           selectedDictColumn: {},
      //           input: true,
      //           selectThreshold: 0.3,
      //           addResource: false,
      //           disableLimit: false,
      //           smev_req: {},
      //           key: "VariantChoice.KP_APR_10",
      //           validate: {
      //             select: false,
      //           },
      //         },
      //         {
      //           extTypeCheckbox: false,
      //           epgu_selected_vs: {},
      //           components: [
      //             {
      //               extTypeCheckbox: false,
      //               epgu_selected_vs: {},
      //               input: true,
      //               dataGridLabel: false,
      //               tableView: true,
      //               smev_req: {},
      //               require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //               label: "Место работы",
      //               type: "textfield",
      //               key: "textField15",
      //             },
      //             {
      //               extTypeCheckbox: false,
      //               epgu_selected_vs: {},
      //               input: true,
      //               dataGridLabel: false,
      //               tableView: true,
      //               smev_req: {},
      //               require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //               label: "Должность",
      //               type: "textfield",
      //               key: "textField16",
      //             },
      //           ],
      //           collapsed: false,
      //           dataGridLabel: false,
      //           allowPrevious: false,
      //           tableView: false,
      //           require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //           label: "Сведения о месте работы и должности ",
      //           title: "Сведения о месте работы и должности ",
      //           type: "panel",
      //           breadcrumbClickable: true,
      //           collapsible: true,
      //           buttonSettings: {
      //             cancel: true,
      //             next: true,
      //             previous: true,
      //           },
      //           input: false,
      //           smev_req: {},
      //           theme: "info",
      //           key: "panel5",
      //           esiaKey: {},
      //         },
      //         {
      //           extTypeCheckbox: false,
      //           epgu_selected_vs: {},
      //           components: [
      //             {
      //               extTypeCheckbox: false,
      //               epgu_selected_vs: {},
      //               components: [
      //                 {
      //                   extTypeCheckbox: false,
      //                   epgu_selected_vs: {},
      //                   input: false,
      //                   components: [
      //                     {
      //                       extTypeCheckbox: false,
      //                       epgu_selected_vs: {},
      //                       input: true,
      //                       dataGridLabel: false,
      //                       tableView: true,
      //                       smev_req: {},
      //                       require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                       label: "Уровень образования",
      //                       type: "textfield",
      //                       key: "textField17",
      //                     },
      //                     {
      //                       extTypeCheckbox: false,
      //                       epgu_selected_vs: {},
      //                       input: true,
      //                       dataGridLabel: false,
      //                       tableView: true,
      //                       smev_req: {},
      //                       require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                       label: "Наименование образовательной организации",
      //                       type: "textfield",
      //                       key: "textField18",
      //                     },
      //                     {
      //                       extTypeCheckbox: false,
      //                       epgu_selected_vs: {},
      //                       input: true,
      //                       dataGridLabel: false,
      //                       tableView: true,
      //                       smev_req: {},
      //                       require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                       label: "Полученная специальность",
      //                       type: "textfield",
      //                       key: "textField10",
      //                     },
      //                     {
      //                       extTypeCheckbox: false,
      //                       epgu_selected_vs: {},
      //                       input: true,
      //                       dataGridLabel: false,
      //                       tableView: true,
      //                       smev_req: {},
      //                       require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                       label: "Квалификация",
      //                       type: "textfield",
      //                       key: "textField20",
      //                     },
      //                     {
      //                       hideInputLabels: false,
      //                       extTypeCheckbox: false,
      //                       epgu_selected_vs: {},
      //                       defaultValue: "00/00/0000",
      //                       dataGridLabel: false,
      //                       tableView: false,
      //                       require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                       label: "День",
      //                       type: "day",
      //                       useLocaleSettings: false,
      //                       input: true,
      //                       inputsLabelPosition: "top",
      //                       smev_req: {},
      //                       fields: {
      //                         month: {
      //                           hide: true,
      //                         },
      //                         year: {
      //                           hide: false,
      //                         },
      //                         day: {
      //                           hide: true,
      //                         },
      //                       },
      //                       key: "day",
      //                       hideLabel: true,
      //                     },
      //                   ],
      //                   dataGridLabel: false,
      //                   smev_req: {},
      //                   tableView: false,
      //                   require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                   label: "",
      //                   type: "fieldset",
      //                   key: "fieldSet1",
      //                   esiaKey: {},
      //                 },
      //               ],
      //               enableRowGroups: false,
      //               defaultValue: [
      //                 {
      //                   dateTime5: "",
      //                   textField20: "",
      //                   textField10: "",
      //                   textField17: "",
      //                   textField18: "",
      //                 },
      //               ],
      //               dataGridLabel: false,
      //               tableView: false,
      //               reorder: false,
      //               require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //               label: "Сведения о полученном образовании ",
      //               layoutFixed: false,
      //               type: "datagrid",
      //               initEmpty: false,
      //               input: true,
      //               groupToggle: false,
      //               defaultOpen: false,
      //               smev_req: {},
      //               addAnotherPosition: "bottom",
      //               key: "dataGrid",
      //               hideLabel: true,
      //             },
      //             {
      //               extTypeCheckbox: false,
      //               epgu_selected_vs: {},
      //               components: [
      //                 {
      //                   extTypeCheckbox: false,
      //                   epgu_selected_vs: {},
      //                   input: true,
      //                   dataGridLabel: false,
      //                   tableView: true,
      //                   smev_req: {},
      //                   require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                   label: "Номер решения об отказе ",
      //                   type: "textfield",
      //                   key: "textField21",
      //                 },
      //                 {
      //                   extTypeCheckbox: false,
      //                   epgu_selected_vs: {},
      //                   input: true,
      //                   widget: {
      //                     minDate: null,
      //                     enableTime: true,
      //                     format: "dd-MM-yyyy",
      //                     displayInTimezone: "viewer",
      //                     noCalendar: false,
      //                     type: "calendar",
      //                     locale: "ru",
      //                     time_24hr: false,
      //                     allowInput: true,
      //                     minuteIncrement: 1,
      //                     mode: "single",
      //                     useLocaleSettings: false,
      //                     maxDate: null,
      //                     hourIncrement: 1,
      //                   },
      //                   dataGridLabel: false,
      //                   format: "dd-MM-yyyy",
      //                   tableView: false,
      //                   smev_req: {},
      //                   require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                   label: "Дата отказа в установлении категории",
      //                   type: "datetime",
      //                   key: "dateTime6",
      //                 },
      //                 {
      //                   extTypeCheckbox: false,
      //                   epgu_selected_vs: {},
      //                   input: true,
      //                   dataGridLabel: false,
      //                   tableView: true,
      //                   smev_req: {},
      //                   require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                   label: "Наименование органа, принявшего решение ",
      //                   type: "textfield",
      //                   key: "textField22",
      //                 },
      //               ],
      //               hidden: true,
      //               conditional: {
      //                 show: true,
      //                 eq: "2",
      //                 when: "VariantChoice.KP_APR_05",
      //               },
      //               collapsed: false,
      //               dataGridLabel: false,
      //               allowPrevious: false,
      //               tableView: false,
      //               require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //               label:
      //                 "Реквизиты решения об отказе в установлении квалификационной категории",
      //               title:
      //                 "Реквизиты решения об отказе в установлении квалификационной категории",
      //               type: "panel",
      //               breadcrumbClickable: true,
      //               collapsible: true,
      //               buttonSettings: {
      //                 cancel: true,
      //                 next: true,
      //                 previous: true,
      //               },
      //               input: false,
      //               smev_req: {},
      //               theme: "info",
      //               key: "panel7",
      //               esiaKey: {},
      //             },
      //             {
      //               extTypeCheckbox: false,
      //               epgu_selected_vs: {},
      //               components: [
      //                 {
      //                   extTypeCheckbox: false,
      //                   epgu_selected_vs: {},
      //                   input: true,
      //                   dataGridLabel: false,
      //                   tableView: true,
      //                   smev_req: {},
      //                   require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                   label: "Номер решения ",
      //                   type: "textfield",
      //                   key: "textField23",
      //                 },
      //                 {
      //                   extTypeCheckbox: false,
      //                   epgu_selected_vs: {},
      //                   input: true,
      //                   widget: {
      //                     minDate: null,
      //                     enableTime: true,
      //                     format: "dd-MM-yyyy",
      //                     displayInTimezone: "viewer",
      //                     noCalendar: false,
      //                     type: "calendar",
      //                     locale: "ru",
      //                     time_24hr: false,
      //                     allowInput: true,
      //                     minuteIncrement: 1,
      //                     mode: "single",
      //                     useLocaleSettings: false,
      //                     maxDate: null,
      //                     hourIncrement: 1,
      //                   },
      //                   dataGridLabel: false,
      //                   format: "dd-MM-yyyy",
      //                   tableView: false,
      //                   smev_req: {},
      //                   require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                   label: "Дата установления категории ",
      //                   type: "datetime",
      //                   key: "dateTime7",
      //                 },
      //                 {
      //                   extTypeCheckbox: false,
      //                   epgu_selected_vs: {},
      //                   input: true,
      //                   dataGridLabel: false,
      //                   tableView: true,
      //                   smev_req: {},
      //                   require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                   label: "Наименование органа, принявшего решение ",
      //                   type: "textfield",
      //                   key: "textField24",
      //                 },
      //               ],
      //               conditional: {
      //                 show: false,
      //                 eq: "2",
      //                 when: "VariantChoiceT.KP_APR_04",
      //               },
      //               collapsed: false,
      //               dataGridLabel: false,
      //               allowPrevious: false,
      //               tableView: false,
      //               require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //               label:
      //                 "Реквизиты решения об установлении квалификационной категории",
      //               title:
      //                 "Реквизиты решения об установлении квалификационной категории",
      //               type: "panel",
      //               breadcrumbClickable: true,
      //               collapsible: true,
      //               buttonSettings: {
      //                 cancel: true,
      //                 next: true,
      //                 previous: true,
      //               },
      //               input: false,
      //               smev_req: {},
      //               theme: "info",
      //               key: "panel8",
      //               esiaKey: {},
      //             },
      //             {
      //               extTypeCheckbox: false,
      //               epgu_selected_vs: {},
      //               components: [
      //                 {
      //                   extTypeCheckbox: false,
      //                   epgu_selected_vs: {},
      //                   input: true,
      //                   dataGridLabel: false,
      //                   tableView: true,
      //                   smev_req: {},
      //                   require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                   label: "Общий педагогический стаж ",
      //                   type: "textfield",
      //                   key: "textField25",
      //                 },
      //                 {
      //                   extTypeCheckbox: false,
      //                   epgu_selected_vs: {},
      //                   input: true,
      //                   dataGridLabel: false,
      //                   tableView: true,
      //                   smev_req: {},
      //                   require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                   label: "Стаж работы в занимаемой должности ",
      //                   type: "textfield",
      //                   key: "textField26",
      //                 },
      //                 {
      //                   extTypeCheckbox: false,
      //                   epgu_selected_vs: {},
      //                   input: true,
      //                   dataGridLabel: false,
      //                   tableView: true,
      //                   smev_req: {},
      //                   require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //                   label: "Стаж работы в образовательной организации ",
      //                   type: "textfield",
      //                   key: "textField27",
      //                 },
      //               ],
      //               collapsed: false,
      //               dataGridLabel: false,
      //               allowPrevious: false,
      //               tableView: false,
      //               require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //               label: "Сведения о педагогическом стаже работы ",
      //               title: "Сведения о педагогическом стаже работы ",
      //               type: "panel",
      //               breadcrumbClickable: true,
      //               collapsible: true,
      //               buttonSettings: {
      //                 cancel: true,
      //                 next: true,
      //                 previous: true,
      //               },
      //               input: false,
      //               smev_req: {},
      //               theme: "info",
      //               key: "panel9",
      //               esiaKey: {},
      //             },
      //           ],
      //           collapsed: false,
      //           dataGridLabel: false,
      //           allowPrevious: false,
      //           tableView: false,
      //           require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //           label: "Сведения о полученном образовании ",
      //           title: "Сведения о полученном образовании ",
      //           type: "panel",
      //           breadcrumbClickable: true,
      //           collapsible: true,
      //           buttonSettings: {
      //             cancel: true,
      //             next: true,
      //             previous: true,
      //           },
      //           input: false,
      //           smev_req: {},
      //           theme: "info",
      //           key: "panel6",
      //           esiaKey: {},
      //         },
      //       ],
      //       legend: "Сведения для получения услуги",
      //       dataGridLabel: false,
      //       tableView: false,
      //       require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //       label: "Сведения для получения услуги",
      //       type: "fieldset",
      //       input: false,
      //       smev_req: {},
      //       key: "fieldSet2",
      //       esiaKey: {},
      //     },
      //     {
      //       extTypeCheckbox: false,
      //       epgu_selected_vs: {},
      //       dataGridLabel: false,
      //       tableView: false,
      //       require: [{}, {}, {}, {}, {}, {}, {}, {}, {}, {}],
      //       label:
      //         "Документы, подтверждающие личные профессиональные достижения",
      //       type: "file",
      //       url: "/o/template/files/uploadFormFile",
      //       fileTypes: [
      //         {
      //           label: "",
      //           value: "",
      //         },
      //       ],
      //       input: true,
      //       webcam: false,
      //       smev_req: {},
      //       key: "file1",
      //     },
      //   ],
      // },
    };
  },

  components: {
    Loader,
    MeasureApplicationForm,
  },

  methods: {
    onLoad() {
      this.loading = true;
      setTimeout(() => {
        this.loading = false;
      }, 5000);
    },
    ajaxRequest(service, id, responseTarget, log) {
      const xhr = new XMLHttpRequest();
      const url =
        // "https://open-newtemplate.isands.ru/open-core/api/serv/" +
        // "http://192.168.18.171:8080/open-core/api/serv/" +
        "http://192.168.18.171:8080/api/serv/" +
        // "https://open-demo.isands.ru/api/serv/" +
        service +
        "?id=" +
        id;
      xhr.open("GET", url);
      xhr.responseType = "json";
      xhr.onload = () => {
        console.log(log);
        console.log(xhr.response);
        this[responseTarget] = xhr.response;
        if (responseTarget.applicationDTO) {
          this[responseTarget].applicationDTO.data = JSON.parse(xhr.response.applicationDTO.data);
          this[responseTarget].applicationDTO.form.scheme = JSON.parse(xhr.response.applicationDTO.form.scheme);
        }
      };
      xhr.send();
    },
    getMeasure() {
      this.ajaxRequest(
        "get-model",
        this.$route.params.subId,
        "measure",
        "Информация по мере поддержки"
      );
    },
    getForms() {
      this.ajaxRequest(
        "get-forms",
        this.$route.params.subId,
        "measureForms",
        "Список форм"
      );
    },
    getStartForm() {
      this.ajaxRequest(
        "get-appData",
        this.$route.params.subId,
        "startForm",
        "Стартовая форма"
      );
    },
    measurePeriod() {
      let period = "";
      const options = {
        day: "2-digit",
        month: "2-digit",
        year: "numeric",
      };
      if (this.measure.startDate) {
        period +=
          "c " +
          new Intl.DateTimeFormat("ru-RU", options).format(
            new Date(this.measure.startDate)
          ) +
          " ";
      }
      if (this.measure.endDate) {
        period +=
          "по " +
          new Intl.DateTimeFormat("ru-RU", options).format(
            new Date(this.measure.endDate)
          );
      }
      if (!this.measure.startDate && !this.measure.endDate) {
        period = "даты не указаны";
      }
      return period;
    },
  },

  mounted: function () {
    this.getMeasure();
    this.getForms();
    this.getStartForm();
    console.log(this.asd.applicationDTO.form.scheme);
  },
};
</script>

<style lang="scss">
$gap: 1rem;
$basic-color: var(--primary);
$text-color: #212529;
$support-color: grey;
$passive-color: #e4e4e4;
$active-color: #fff;

.page-wrapper {
  min-height: 100vh;
  display: flex;
  flex-direction: column;

  .content {
    flex: 1;
  }
}

.support {
  padding-top: $gap/2;

  .support__header {
    .support__name {
      margin-bottom: $gap;
    }

    .support__details {
      & > * {
        margin-bottom: $gap;
      }

      @media (min-width: 768px) {
        display: flex;
        justify-content: space-between;
        align-items: center;
      }

      .support__date {
        color: $support-color;

        b {
          color: $text-color;
        }
      }
    }
  }

  hr {
    margin-top: 0;
  }

  .support__card {
    .support__card__header {
      display: flex;
      justify-content: space-between;

      & > * {
        margin-bottom: $gap;
      }

      .support__owner {
        .support__owner__header {
          color: $support-color;
        }

        .support__owner__logo {
          display: flex;
          font-weight: bolder;
          align-items: center;

          .org-logo {
            height: 38px;
            margin-right: $gap/2;
            margin-top: $gap/2;
          }

          .support__owner__name {
            margin-top: $gap/2;
          }
        }
      }

      .support__conditions {
        @media (min-width: 768px) {
          text-align: right;
        }

        .support__conditions__header {
          color: $support-color;
        }

        .support__size {
          font-size: 1.75rem;
          font-weight: 500;
        }

        .support__size__info {
          color: $support-color;
        }
      }

      .support__buttons {
        display: flex;
        align-items: start;

        @media (min-width: 768px) {
          justify-content: flex-end;
        }

        .support__icon {
          height: 38px;
          border: 1px solid $basic-color;
          border-radius: 0.25rem;
          margin-right: $gap/2;
        }
      }
    }

    hr {
      margin-top: 0;
    }

    .card {
      border: none;

      .nav {
        background-color: transparent;
        padding: 0;
        margin-bottom: $gap;

        @media (min-width: 768px) {
          padding-right: 1.25rem;
        }
      }

      .tab-content {
        margin-bottom: $gap;

        .tab-pane {
          padding: 0;

          @media (min-width: 768px) {
            padding-left: 1.25rem;
          }
        }

        ul {
          padding-left: 1.25rem;
        }

        :nth-last-child(1) {
          margin-bottom: 0;
        }
      }
    }
  }
}
</style>
