<template>
    <div class="page-wrapper">
        <section class="support">
            <div class="support__wrapper container">

                <div class="support__header">
                    <h4 class="support__name">
                        {{ measure.name }}
                    </h4>
                    <div class="support__details">
                        <div class="support__date">Приём заявок<br>
                            <b>{{ measurePeriod() }}</b>
                        </div>
                        <div class="support__manual">
                            <button class="support__manual__button btn btn-outline-primary">
                                Как подать заявку?
                            </button>
                        </div>
                    </div>
                </div>

                <hr>

                <div class="support__card">
                    <div class="support__card__header row">
                        <div class="support__owner col-md-6 col-xl-4">
                            <div class="support__owner__header">
                                Инициатор
                            </div>
                            <div class="support__owner__logo">
                                <img class="org-logo" src="images/initiators_logo/mshlogo.png" alt="">
                                <div class="support__owner__name">
                                    Министерство сельского хозяйства
                                </div>
                            </div>
                        </div>
                        <div class="support__conditions col-12 col-md-6 col-xl-5">
                            <div class="support__conditions__header">Размер поддержки</div>
                            <div class="support__size">до 20 000 000 рублей</div>
                            <div class="support__size__info"></div>
                        </div>
                        <div class="support__buttons col">
                            <img class="support__icon" src="@/assets/electronic.png"
                                 title="По данной мере поддержки есть возможность электронной подачи" alt="">
                            <button class="btn btn-outline-primary"
                                    @click="onLoad"
                            >
                                Подать заявку
                            </button>
                        </div>
                    </div>

                    <hr>

                    <b-card no-body>
                        <b-tabs pills card vertical nav-wrapper-class="col-12 col-md-4">
                            <b-tab title="Описание" active>
                                <b-card-text>
                                    <h3>Описание</h3>
                                    <p>{{ measure.description }}</p>
                                    <hr>
                                    <p>Субсидии в сельском хозяйстве на возмещение части затрат предоставляются
                                        министерством сельского хозяйства, до которого в соответствии с бюджетным
                                        законодательством Российской Федерации как до получателя бюджетных средств
                                        доведены в установленном порядке лимиты бюджетных обязательств на
                                        предоставление субсидий на соответствующий финансовый год и плановый период
                                        на компенсацию части затрат, понесенных в текущем финансовом году
                                        (возмещение части затрат на закупку сельскохозяйственной продукции, с целью
                                        развития на сельских территориях региона сельского хозяйства.
                                    </p>
                                    <p>
                                        Субсидия предоставляется при соблюдении условий:
                                    </p>
                                    <ul>
                                        <li>получатели субсидий - юридические лица не находится в процессе
                                            реорганизации, ликвидации, в отношении него не введена процедура
                                            банкротства, деятельность получателя не приостановлена;
                                        </li>
                                        <li>получатели субсидий – индивидуальные предприниматели не прекратили
                                            деятельность в качестве индивидуального предпринимателя, а также в
                                            отношении их не введена процедура банкротства;
                                        </li>
                                        <li>государственной регистрации или постановки на учет в налоговом органе
                                            получателей субсидий;
                                        </li>
                                        <li>отсутствии у получателей субсидий неисполненной обязанности по уплате
                                            налогов, сборов, страховых взносов, пеней, штрафов, процентов,
                                            подлежащих уплате в соответствии с законодательством Российской
                                            Федерации о налогах и сборах;
                                        </li>
                                        <li>отсутствия просроченной задолженности по возврату в областной бюджет
                                            субсидий, бюджетных инвестиций и иной просроченной (неурегулированной)
                                            задолженности по денежным обязательствам;
                                        </li>
                                        <li>получатели субсидий не являются иностранными юридическими лицами, а
                                            также российскими юридическими лицами, в уставном (складочном) капитале
                                            которых доля участия иностранных юридических лиц, местом регистрации
                                            которых является государство или территория, включенные в утверждаемый
                                            Министерством финансов Российской Федерации перечень государств и
                                            территорий, предоставляющих льготный налоговый режим налогообложения и
                                            (или) не предусматривающих раскрытия и предоставления информации при
                                            проведении финансовых операций (офшорные зоны) в отношении таких
                                            юридических лиц, в совокупности превышает 50 процентов.
                                        </li>
                                    </ul>
                                </b-card-text>
                            </b-tab>
                            <b-tab title="Требования к заявителю">
                                <b-card-text><h3>Требования к заявителю</h3>
                                    <p>Получателями грантов являются физические лица, занимающиеся научной
                                        (научно-исследовательской), научно-технической или инновационной
                                        деятельностью
                                        научных организациях, образовательных организациях высшего образования, иных
                                        организациях, один из видов осуществляемой деятельности которых относится к
                                        классу 72 «Научные исследования и разработки» раздела M «Деятельность
                                        профессиональная, научная и техническая» Общероссийского классификатора
                                        видов
                                        экономической деятельности ОК 029-2014 (КДЕС Ред. 2), принятого приказом
                                        Федерального агентства по техническому регулированию и метрологии от
                                        31.01.2014
                                        № 14-ст, за исключением государственных (муниципальных) учреждений (далее —
                                        организации, осуществляющие научные исследования и разработки), отвечающие
                                        требованиям, предусмотренным пунктом 2.4 Порядка, и являющиеся на дату
                                        подачи
                                        заявки на предоставление гранта (далее — заявка):
                                    </p>
                                    <ul>
                                        <li>студентами (курсантами) — лицами, осваивающими образовательные программы
                                            бакалавриата, специалитета, магистратуры в возрасте до 30 лет
                                            включительно;
                                        </li>
                                        <li>аспирантами, научными работниками, педагогическими работниками,
                                            специалистами (инженерно-техническими работниками) образовательных
                                            организаций высшего образования или научных организаций без ученой
                                            степени в
                                            возрасте до 30 лет включительно;
                                        </li>
                                        <li>научными работниками, педагогическими работниками, имеющими ученую
                                            степень
                                            кандидата наук в возрасте до 35 лет включительно либо имеющими ученую
                                            степень доктора наук в возрасте до 40 лет включительно;
                                        </li>
                                        <li>специалистами либо руководителями организаций, осуществляющих научные
                                            исследования и разработки, в возрасте до 35 лет включительно.
                                        </li>
                                    </ul>
                                    <p>Получатели грантов должны соответствовать на первое число месяца, в котором
                                        объявлен конкурс на предоставление гранта, следующим требованиям:</p>
                                    <ul>
                                        <li>не должны являться получателями средств из бюджета города на цели
                                            предоставления гранта, указанные в пункте 1.3 Порядка, в течение двух
                                            предшествующих лет;
                                        </li>
                                        <li>не должны иметь просроченную задолженность по возврату в бюджет города
                                            субсидий, бюджетных инвестиций, и иную просроченную задолженность перед
                                            бюджетом города;
                                        </li>
                                        <li>не должны иметь неисполненную обязанность по уплате налогов, сборов,
                                            страховых взносов, пеней, штрафов и процентов, подлежащих уплате в
                                            соответствии с законодательством Российской Федерации о налогах и
                                            сборах.
                                        </li>
                                    </ul>
                                </b-card-text>
                            </b-tab>
                            <b-tab title="Необходимые документы для предоставления меры поддержки">
                                <b-card-text>
                                    <h3>Необходимые документы для предоставления меры поддержки</h3>
                                    <p>Для участия в конкурсе соискатель гранта вносит данные о себе в
                                        предусмотренные
                                        для заполнения поля в Системе и размещает в ней электронные образы следующей
                                        конкурсной документации, полученной в результате сканирования документов на
                                        бумажных носителях:</p>
                                    <ul>
                                        <li>заявки по форме согласно приложению 1 к Порядку, согласованной
                                            руководителем
                                            организации, в которой учится или работает соискатель гранта, и печатью
                                            данной организации (при наличии);
                                        </li>
                                        <li>нотариально заверенного перевода документа, удостоверяющего личность
                                            соискателя гранта (в случае если соискатель гранта является иностранным
                                            гражданином);
                                        </li>
                                        <li>ходатайства ученого совета научной или образовательной организации
                                            высшего
                                            образования, руководителя организации, осуществляющей научные
                                            исследования
                                            или разработки, в которой учится или работает соискатель гранта, о
                                            предоставлении гранта соискателю гранта, включающего в себя описание
                                            значимости результатов, полученных в рамках научного проекта, личного
                                            вклада
                                            соискателя гранта в достижение полученных результатов и согласие на
                                            предоставление соискателю гранта условий для выполнения научного проекта
                                            по
                                            теме гранта;
                                        </li>
                                        <li>диплома о присуждении соискателю гранта ученой степени либо приказа
                                            министерства науки и высшего образования Российской Федерации о выдаче
                                            диплома (при наличии);
                                        </li>
                                        <li>финансовых документов, подтверждающих осуществление затрат,
                                            предусмотренных
                                            пунктом 1.3 Порядка (в случае подачи заявки в целях возмещения затрат,
                                            понесенных в течение 12 месяцев, предшествующих дате подачи заявки);
                                        </li>
                                        <li>свидетельства о постановке соискателя гранта на учет в налоговом органе;
                                        </li>
                                        <li>документа, подтверждающего регистрацию в системе индивидуального
                                            (персонифицированного) учета, в том числе в форме электронного
                                            документа;
                                        </li>
                                        <li>согласия соискателя гранта на публикацию (размещение) в
                                            информационно-телекоммуникационной сети «Интернет» информации о
                                            соискателе
                                            гранта, информации, содержащейся в заявке соискателя гранта и иной
                                            информации, связанной с участием в конкурсе;
                                        </li>
                                        <li>согласия соискателя гранта и лиц, являющихся поставщиками (подрядчиками,
                                            исполнителями) по договорам, заключенным в целях исполнения обязательств
                                            по
                                            договорам о предоставлении грантов на финансовое обеспечение затрат в
                                            связи
                                            с производством (реализацией) товаров, выполнением работ, оказанием
                                            услуг
                                            (за исключением государственных (муниципальных) унитарных предприятий,
                                            хозяйственных товариществ и обществ с участием публично-правовых
                                            образований
                                            в их уставных (складочных) капиталах, а также коммерческих организаций с
                                            участием таких товариществ и обществ в их уставных (складочных)
                                            капиталах),
                                            на осуществление департаментом и органами муниципального финансового
                                            контроля проверок соблюдения условий, целей и порядка предоставления
                                            гранта;
                                        </li>
                                        <li>согласия соискателя гранта на обработку департаментом его персональных
                                            данных в соответствии с Федеральным законом от 27.07.2006 № 152-ФЗ «О
                                            персональных данных».
                                        </li>
                                    </ul>
                                </b-card-text>
                            </b-tab>
                            <b-tab title="Порядок рассмотрения заявок участников">
                                <b-card-text>
                                    <h3>Порядок рассмотрения заявок участников</h3>
                                    <p>Департамент в течение срока приема заявок осуществляет предварительный анализ
                                        заявок соискателей и документов на предмет правильности и полноты их
                                        представления и, в случае необходимости уточнения информации, осуществляет
                                        подготовку письменного уведомления, направляет его соискателю гранта
                                        посредством
                                        Системы на адрес электронной почты, указанный в заявке.</p>
                                    <p>Предварительный анализ осуществляется только в случае подачи соискателем
                                        гранта
                                        заявки не позднее чем за 10 дней до даты окончания срока приема заявок
                                        (включительно).</p>
                                    <p>Соискатель гранта вправе представить скорректированную (уточненную) заявку до
                                        даты окончания срока приема заявок (включительно). Непредставление
                                        соискателем
                                        гранта скорректированной (уточненной) заявки в указанный срок расценивается
                                        как
                                        отказ от участия в конкурсе.</p>
                                    <p>Департамент в течение 15 дней со дня окончания срока приема заявок принимает
                                        решение о признании соискателя гранта участником конкурса при отсутствии
                                        оснований, предусмотренных пунктом 2.9 Порядка, направляет письма о
                                        назначении
                                        экспертов.</p>
                                    <p>Экспертиза поданных на участие в конкурсе заявок и подготовка экспертного
                                        заключения осуществляется экспертами в Системе в течение 14 дней со дня
                                        назначения им заявок.</p>
                                    <p>Оценка заявок участников конкурса экспертами осуществляется по шкале от 0 до
                                        10
                                        баллов с последующим суммированием баллов по критериям. Итоговое количество
                                        баллов определяется как средняя арифметическая сумма баллов, присвоенных
                                        каждым
                                        экспертом по всем критериям оценки (с округлением до тысячных).</p>
                                    <p>Заявка участника конкурса не допускается к рассмотрению на заседании
                                        координационного совета при наличии хотя бы одного заключения о
                                        несоответствии
                                        научного проекта.</p>
                                    <p>Департамент в течение пяти дней со дня завершения оценки экспертами последней
                                        заявки формирует общий рейтинг участников конкурса.</p>
                                    <p>Координационный совет не позднее 20 дней со дня получения доступа к просмотру
                                        заявок участников конкурса, экспертным заключениям и общему рейтингу
                                        участников
                                        рассматривает заявки и принимает решение о признании участников конкурса
                                        победителями с указанием размера грантов.</p>
                                    <p>Победителями конкурса признаются участники, набравшие наибольшее количество
                                        баллов и имеющие наиболее высокие позиции в общем рейтинге. Победителем
                                        конкурса
                                        не может быть признан участник, заявка которого набрала менее 3 баллов.</p>
                                    <p>Координационный совет имеет право принять решение, отличное от мнения
                                        экспертов в
                                        части количества баллов, набранных участником конкурса, с последующим
                                        изменением
                                        общего рейтинга, обосновав свое решение в соответствии с критериями оценки,
                                        и
                                        занесением соответствующей информации в протокол заседания.</p>
                                    <p>Протокол заседания координационного совета, содержащий информацию об общем
                                        рейтинге участников и победителях конкурса, подписывается председателем и
                                        секретарем координационного совета в течение 10 дней с даты проведения
                                        заседания
                                        координационного совета и направляется в департамент.</p>
                                </b-card-text>
                            </b-tab>
                            <b-tab title="Администратор меры">
                                <b-card-text>
                                    <h3>Администратор меры</h3>
                                    <p>Территориальный уровень меры поддержки: Региональный</p>
                                    <p>Название организации: Департамент промышленности, инноваций и
                                        предпринимательства</p>
                                    <p>Ссылка на сайт администратора меры поддержки: <a href="https://dep.test.ru">https://dep.test.ru/</a>
                                    </p>
                                    <p>Контактная информация: 200-00-00, e-mail: <a href="mailto:test@test.ru">test@test.ru</a>
                                    </p>
                                </b-card-text>
                            </b-tab>
                            <b-tab title="Нормативная правовая база">
                                <b-card-text>
                                    <h3>Нормативно-правовая база</h3>
                                    <p>Конкурс проводится в соответствии с Порядком предоставления грантов в форме
                                        субсидий в сфере научной и инновационной деятельности, утвержденным
                                        постановлением от 01.01.2021 № 200.</p>
                                </b-card-text>
                            </b-tab>
                        </b-tabs>
                    </b-card>

                </div>

            </div>
        </section>
        <Loader v-show="loading"/>
    </div>
</template>

<script>
    import Loader from "@/components/Loader";

    export default {
        name: "SubsidyInfoTemp",

        props: [
            "subsidyId"
        ],

        data() {
            return {
                loading: false,
                measure: [],
            }
        },

        components: {
            Loader,
        },

        methods: {
            onLoad() {
                this.loading = true;
                setTimeout(() => {
                    this.loading = false
                }, 5000)
            },
            getMeasure() {
                const xhr = new XMLHttpRequest();
                const url =
                    "http://192.168.18.171:8080/open-core/api/serv/get-model?id=" + this.$route.params.subId;
                xhr.open("GET", url);
                xhr.responseType = "json";
                xhr.onload = () => {
                    console.log("Получена информация по услуге " + this.$route.params.subId);
                    console.log(xhr.response);
                    this.measure = xhr.response;
                };
                xhr.send();
            },
            measurePeriod() {
                let period = "";
                const options = {
                    day: "2-digit",
                    month: "2-digit",
                    year: "numeric",
                };
                if (this.measure.startDate) {
                    period +=
                        "c " +
                        new Intl.DateTimeFormat("ru-RU", options).format(
                            new Date(this.measure.startDate)
                        ) +
                        " ";
                }
                if (this.measure.endDate) {
                    period +=
                        "по " +
                        new Intl.DateTimeFormat("ru-RU", options).format(
                            new Date(this.measure.endDate)
                        );
                }
                if (!this.measure.startDate && !this.measure.endDate) {
                    period = "даты не указаны";
                }
                return period;
            },
        },

        mounted: function () {
            this.getMeasure();
        },

    }
</script>

<style lang="scss">
    $gap: 1rem;
    $basic-color: var(--primary);
    $text-color: #212529;
    $support-color: grey;
    $passive-color: #e4e4e4;
    $active-color: #fff;

    .page-wrapper {
        min-height: 100vh;
        display: flex;
        flex-direction: column;

        .content {
            flex: 1;
        }
    }

    .support {
        padding-top: $gap/2;

        .support__header {

            .support__name {
                margin-bottom: $gap;
            }

            .support__details {
                & > * {
                    margin-bottom: $gap;
                }

                @media (min-width: 768px) {
                    display: flex;
                    justify-content: space-between;
                    align-items: center;
                }

                .support__date {
                    color: $support-color;

                    b {
                        color: $text-color;
                    }
                }
            }
        }

        hr {
            margin-top: 0;
        }

        .support__card {

            .support__card__header {
                display: flex;
                justify-content: space-between;

                & > * {
                    margin-bottom: $gap;
                }

                .support__owner {

                    .support__owner__header {
                        color: $support-color;
                    }

                    .support__owner__logo {
                        display: flex;
                        font-weight: bolder;
                        align-items: center;

                        .org-logo {
                            height: 38px;
                            margin-right: $gap/2;
                            margin-top: $gap/2;
                        }

                        .support__owner__name {
                            margin-top: $gap/2;
                        }
                    }
                }

                .support__conditions {

                    @media (min-width: 768px) {
                        text-align: right;
                    }

                    .support__conditions__header {
                        color: $support-color;
                    }

                    .support__size {
                        font-size: 1.75rem;
                        font-weight: 500;
                    }

                    .support__size__info {
                        color: $support-color;
                    }
                }

                .support__buttons {
                    display: flex;
                    align-items: start;

                    @media (min-width: 768px) {
                        justify-content: flex-end;
                    }


                    .support__icon {
                        height: 38px;
                        border: 1px solid $basic-color;
                        border-radius: 0.25rem;
                        margin-right: $gap/2;
                    }
                }
            }

            hr {
                margin-top: 0;
            }

            .card {
                border: none;

                .nav {
                    background-color: transparent;
                    padding: 0;
                    margin-bottom: $gap;

                    @media (min-width: 768px) {
                        padding-right: 1.25rem;
                    }
                }

                .tab-content {
                    margin-bottom: $gap;

                    .tab-pane {
                        padding: 0;

                        @media (min-width: 768px) {
                            padding-left: 1.25rem;
                        }

                    }

                    ul {
                        padding-left: 1.25rem;
                    }

                    :nth-last-child(1) {
                        margin-bottom: 0;
                    }
                }
            }
        }
    }

</style>
