<template>
    <div>
        <HeaderOffcavas/>
    <main class="content">

        <section class="support">
            <div class="support__wrapper container">

                <div class="support__header">
                    <h4 class="support__name">Грант участникам инновационного кластера на территории города Москвы на
                        возмещение затрат в целях реализации комплексных инновационных проектов (КИП – собственные
                        средства)
                    </h4>
                    <div class="support__details">
                        <div class="support__date">Приём заявок до 01.11.2021</div>
                        <div class="support__manual">
                            <div class="support__manual__heading mb-2">Инструкция по онлайн подаче заявок</div>
                            <button class="support__manual__button btn btn-outline-secondary">Посмотреть инструкцию
                            </button>
                        </div>
                    </div>
                </div>

                <hr>

                <div class="support__card">
                    <div class="support__card__header row">
                        <div class="support__owner col-12 col-sm-3">
                            <div class="support__owner__header">
                                Инициатор
                            </div>
                            <div class="support__owner__logo">
                                <img class="me-2" src="img/default.jpg" alt="">
                                <div class="support__owner__name">Фонд МИК</div>
                            </div>
                        </div>
                        <div class="support__conditions col-12 col-sm-6">
                            <div class="support__conditions__header">Размер поддержки</div>
                            <div class="support__size">до 600 млн.руб.</div>
                            <div class="support__size__info">до 200 млн рублей в год в течение 3 финансовых лет, но не
                                более
                                суммы налогов уплаченных в бюджет Москвы за 2 года, предшествующих году подачи заявки
                            </div>
                        </div>
                        <div class="support__buttons col-12 col-sm-3">
                            <img src="img/default.jpg" alt="">
                            <button class="btn btn-outline-secondary ms-2">Подать заявку</button>
                        </div>
                    </div>

                    <hr>

                    <b-card no-body>
                        <b-tabs pills card vertical nav-wrapper-class="w-25">
                            <b-tab title="Описание" active>
                                <b-card-text>
                                    <h3>Описание</h3>
                                    <p>Грант предоставляется в целях финансовой поддержки реализации комплексных
                                        инновационных
                                        проектов, предусматривающих комплекс мероприятий по осуществлению инноваций, в
                                        том
                                        числе
                                        созданию нового продукта и (или) использованию новой технологии при создании
                                        продукта.</p>
                                    <p>Принять участие в программе могут юридические лица и индивидуальные
                                        предприниматели -
                                        участники Московского инновационного кластера, реализующие проект на территории
                                        г.
                                        Москвы, независимо от сферы деятельности (без ограничений по ОКВЭД).</p>
                                    <p>Фактически понесенные и документально подтвержденные затраты по следующим
                                        направлениям:</p>
                                    <ul>
                                        <li>Затраты на создание, приобретение, реконструкцию, капитальный ремонт объекта
                                            (части
                                            объекта) капитального строительства в городе Москве, используемого для
                                            реализации
                                            проекта.
                                        </li>
                                        <li>Затраты на приобретение оборудования (за исключением транспортных средств),
                                            имеющего
                                            срок полезного использования более 5 лет, используемого для реализации
                                            проекта.
                                        </li>
                                        <li>Затраты на приобретение и (или) техническое сопровождение программного
                                            обеспечения,
                                            используемого для реализации проекта.
                                        </li>
                                        <li>Затраты на приобретение исключительных прав на результаты интеллектуальной
                                            деятельности, прав использования результатов интеллектуальной деятельности,
                                            используемых для реализации проекта:
                                            <ul>
                                                <li>программы для электронных вычислительных машин;</li>
                                                <li>базы данных;</li>
                                                <li>изобретения;</li>
                                                <li>полезные модели;</li>
                                                <li>промышленные образцы;</li>
                                                <li>селекционные достижения;</li>
                                                <li>топологии интегральных микросхем;</li>
                                                <li>секреты производства (ноу-хау).</li>
                                            </ul>
                                        </li>
                                        <h4>Размер гранта</h4>
                                        <ul>
                                            <li>До 200 млн руб. в год, но не более 15% (20% при приобретении российского
                                                ПО
                                                и оборудования) от суммы затрат на реализацию проекта по направлениям
                                                возмещения, произведенных за год, и не более суммы налогов (включая
                                                НДФЛ),
                                                уплаченных в бюджет г. Москвы за 2 года, предшествующих году подачи
                                                заявки.
                                                Период предоставления гранта – 3 года. Суммарно не более 600 млн руб. /
                                                проект.
                                            </li>
                                            <li>Финансовая поддержка предоставляется в части затрат на реализацию
                                                проекта,
                                                произведенных участником кластера не ранее чем за 2 финансовых года,
                                                предшествующих году подачи заявки.
                                            </li>
                                        </ul>
                                        <h4>Оказание финансовой поддержки осуществляется в период:</h4>
                                        <ol>
                                            <li>Не превышающий 3 финансовых лет со дня подачи заявки, за исключением
                                                случаев,
                                                указанных в пунктах 2 и 3 (2021-2022-2023).
                                            </li>
                                            <li>Не превышающий 2 финансовых лет со дня подачи заявки - в случае
                                                представления
                                                участником кластера заявки в части затрат на реализацию проекта,
                                                произведенных
                                                участником кластера не ранее чем за 1 год, предшествующий году подачи
                                                заявки
                                                (2020-2021-2022).
                                            </li>
                                            <li>Не превышающий 1 финансового года со дня подачи заявки - в случае
                                                представления
                                                участником кластера заявки в части затрат на реализацию проекта,
                                                произведенных
                                                участником кластера не ранее чем за 2 года, предшествующих году подачи
                                                заявки
                                                (2019 – 2020 – 2021).
                                            </li>
                                        </ol>
                                        <p>Таким образом, любые 3 года за период: 2019 – 2020 – 2021 – 2022 – 2023.</p>
                                        <p>В случае оказания участнику кластера в целях реализации одного и того же
                                            проекта
                                            за
                                            один и тот же период финансовой поддержки в соответствии с одним из Порядков
                                            оказания финансовой поддержки, предусмотренных постановлением Правительства
                                            Москвы
                                            от 27 декабря 2019 г. № 1863-ПП, размер гранта подлежит уменьшению на сумму
                                            гранта,
                                            ранее предоставленного участнику кластера.
                                        </p>
                                    </ul>
                                </b-card-text>
                            </b-tab>
                            <b-tab title="Требования к заявителю">
                                <b-card-text><h3>Требования к заявителю</h3>
                                    <ul>
                                        <li>Продолжительность регистрации участника кластера в качестве юридического
                                            лица
                                            или индивидуального предпринимательства не менее 12 календарных месяцев до
                                            дня
                                            подачи заявки.
                                        </li>
                                        <li>Не является иностранным юридическим лицом, а также российским юридическим
                                            лицом,
                                            в уставном (складочном) капитале которого доля участия иностранного
                                            юридического
                                            лица, местом регистрации которого является государство или территория,
                                            включенные в утверждаемый Министерством финансов РФ перечень государств и
                                            территорий, предоставляющих льготный налоговый режим налогообложения и (или)
                                            не
                                            предусматривающих раскрытия и предоставления информации при проведении
                                            финансовых операций (офшорные зоны) в отношении такого юридического лица, в
                                            совокупности превышает 50%.
                                        </li>
                                        <li>Неполучение на первое число месяца, предшествующего месяцу, в котором
                                            планируется заключение договора об оказании финансовой поддержки, средств из
                                            бюджетов бюджетной системы Российской Федерации, средств, предоставляемых
                                            иными
                                            фондами поддержки научной, научно-технической, инновационной деятельности,
                                            на
                                            финансирование проекта по направлениям компенсации, установленным порядками
                                            оказания финансовой поддержки реализации КИП.
                                        </li>
                                        <li>Наличие на праве собственности, ином праве объекта (части объекта)
                                            капитального
                                            строительства, расположенного в городе Москве, используемого для реализации
                                            проекта, на день подачи заявки.
                                        </li>
                                        <li>Наличие оборудования и (или) программного обеспечения, используемых для
                                            реализации проекта, на день подачи заявки.
                                        </li>
                                        <li>Наличие следующих исключительных прав или прав использования результатов
                                            интеллектуальной деятельности, используемых для реализации проекта, на день
                                            подачи заявки:
                                            <ul>
                                                <li>программы для электронных вычислительных машин;</li>
                                                <li>базы данных;</li>
                                                <li>изобретения;</li>
                                                <li>полезные модели;</li>
                                                <li>промышленные образцы;</li>
                                                <li>селекционные достижения;</li>
                                                <li>топологии интегральных микросхем;</li>
                                                <li>секреты производства (ноу-хау).</li>
                                            </ul>
                                        </li>
                                        <p>Требования к ОКВЭД и к размеру компании отсутствуют.</p>
                                    </ul>
                                </b-card-text>
                            </b-tab>
                            <b-tab title="Необходимые документы для предоставления меры поддержки">
                                <b-card-text>
                                    <h3>Необходимые меры поддержки</h3>
                                    <ul>
                                        <li>Опись документов, представляемых в составе заявки</li>
                                        <li>Копии учредительных документов</li>
                                        <li>Копии свидетельства о постановке на налоговый учет</li>
                                        <li>Копия документа, подтверждающего полномочия единоличного исполнительного
                                            органа
                                            и
                                            коллегиального исполнительного органа юридического лица (при наличии),
                                            выписка
                                            из
                                            реестра акционеров
                                        </li>
                                        <li>Копии документов, подтверждающих назначение на должность руководителя
                                            юридического
                                            лица, или доверенность, подтверждающая полномочия лица на осуществление
                                            действий
                                            от
                                            имени организации (при наличии такого лица)
                                        </li>
                                        <li>Копия документа, подтверждающего назначение на должность главного бухгалтера
                                            организации (при наличии такого лица)
                                        </li>
                                    </ul>
                                </b-card-text>
                            </b-tab>
                            <b-tab title="Нормативная правовая баз">
                                <b-card-text>
                                    <h3>Нормативно-правовая база</h3>
                                    <ul>
                                        <li><a href="#">Постановление Правительства Москвы от 27.12.2019 № 1863-ПП</a>
                                        </li>
                                        <li><a href="#">Приказ № 14 от 03.06.2021 о проведении отбора заявок в 2021
                                            г.</a>
                                        </li>
                                        <li><a href="#">Приказ № 19 от 27.07.2021 о продлении отбора</a></li>
                                        <li><a href="#">Приказ № 17 от 03.06.2021 по критериям инновационности</a></li>
                                    </ul>
                                </b-card-text>
                            </b-tab>
                        </b-tabs>
                    </b-card>

                </div>

                <div class="support__info__additional row justify-content-end">
                    <ul class="col-12 col-sm-9">
                        <li>Информационное письмо о заключении независимого оценщика обоснованности стоимости
                            нематериального актива, представляемом при подаче заявки на оказание финансовой поддержки
                            реализации комплексных инновационных проектов
                        </li>
                        <li>Приказ о продлении отбора и о внесении изменений в Приказ № 14 от 03.06.2021 о проведении
                            отбора
                            заявок в 2021 г.
                        </li>
                        <li>Презентация-инструкция по Гранту на КИП</li>
                    </ul>
                </div>

                <div class="support__contacts row justify-content-end mb-2">
                    <div class="col-12 col-sm-9">
                        <div class="support__phone">8 499 577-00-55, доб. 1</div>
                        <div class="support__mail">grant@cluster.mos.ru</div>
                    </div>
                </div>

            </div>
        </section>


    </main>

        <Footer/>
    </div>
</template>

<script>
    import HeaderOffcavas from "@/components/HeaderOffcavas";
    import Footer from "@/components/Footer";

    export default {
        name: "SubsidyInfo",

        components: {
            HeaderOffcavas,
            Footer,
        },
    }
</script>

<style scoped>

</style>
