<template>
  <section class="support">
    <div class="support__wrapper container">
      <div class="support__header">
        <h4 class="support__name text-center py-2">
          Гранты в форме субсидии на развитие инновационного проекта
        </h4>
        <div class="support__details">
          <div class="support__date">
            Приём заявок<br />
            <b>с 11.02.2021 по 12.03.2021</b>
          </div>
          <div class="support__manual">
            <button class="support__manual__button btn btn-outline-primary">
              Как подать заявку?
            </button>
          </div>
        </div>
      </div>

      <hr />

      <div class="support__card">
        <div class="support__card__header row">
          <div class="support__owner col-md-6 col-xl-4">
            <div class="support__owner__header">Инициатор</div>
            <div class="support__owner__logo">
              <img class="org-logo" src="@/assets/mineco_logo.png" alt="" />
              <div class="support__owner__name">
                Министерство экономического развития
              </div>
            </div>
          </div>
          <div class="support__conditions col-12 col-md-6 col-xl-5">
            <div class="support__conditions__header">Размер поддержки</div>
            <div class="support__size">до 400 000 рублей</div>
            <div class="support__size__info">
              (включая сумму налога на доходы физических лиц)
            </div>
          </div>
          <div class="support__buttons col">
            <img class="support__icon" src="@/assets/electronic.png" alt="" />
            <button class="btn btn-outline-primary">Подать заявку</button>
          </div>
        </div>

        <hr />

        <b-card no-body>
          <b-tabs pills card vertical nav-wrapper-class="col-12 col-md-4">
            <b-tab title="Описание" active>
              <b-card-text>
                <h3>Описание</h3>
                <p>
                  Целями проведения ежегодного конкурса "Проекты технологической
                  инициативы" и предоставления гранта являются комплексное
                  развитие региональной инновационной системы и создание
                  благоприятных условий для активизации инновационной
                  деятельности на основе использования научно-технического
                  потенциала.
                </p>
                <p>Грант предоставляется по каждой из следующих номинаций:</p>
                <ul>
                  <li>
                    "Фуднет". Принимаются заявки, в которых содержится описание
                    инновационных проектов, направленных на развитие рынка
                    производства и реализации питательных веществ и конечных
                    видов пищевых продуктов (персонализированных и общих, на
                    основе традиционного сырья и его заменителей), а также
                    сопутствующих IT-решений. Ключевые сегменты данного рынка -
                    индивидуальное персонализированное питание, геномика,
                    альтернативные источники сырья, точное земледелие и
                    органическое сельское хозяйство;
                  </li>
                  <li>
                    "Хелснет". Принимаются заявки, в которых содержится описание
                    инновационных проектов, направленных на развитие рынка
                    персонализированных медицинских услуг и лекарственных
                    средств, обеспечивающих рост продолжительности жизни, а
                    также получение новых эффективных средств профилактики и
                    лечения различных заболеваний. Ключевые сегменты данного
                    рынка - превентивная медицина, спорт и здоровье, медицинская
                    генетика, информационные технологии в медицине, здоровое
                    долголетие, биотехнологии в медицине;
                  </li>
                  <li>
                    "Энерджинет". Принимаются заявки, в которых содержится
                    описание инновационных проектов, направленных на развитие
                    рынка оборудования, программного обеспечения, инжиниринговых
                    и сервисных услуг для разномасштабных комплексных систем и
                    сервисов интеллектуальной энергетики. Ключевые сегменты
                    данного рынка - надежные и гибкие распределительные сети,
                    интеллектуальная распределенная энергетика, персональная
                    энергетика и потребительские сервисы;
                  </li>
                  <li>
                    "Технет". Принимаются заявки, в которых содержится описание
                    инновационных проектов, обеспечивающих технологическую
                    поддержку развития рынков Национальной технологической
                    инициативы и высокотехнологичных отраслей промышленности.
                    Ключевые направления - цифровое проектирование и
                    моделирование, новые материалы (передовые сплавы, полимеры,
                    композиционные и керамические материалы, металлопорошковые
                    композиции и другие), аддитивные, гибридные технологии,
                    числовое программное управление, компоненты робототехники и
                    сенсорика, информационные системы управления предприятием,
                    большие данные ("Big Data"), индустриальный интернет.
                  </li>
                </ul>
                <p>
                  Получатель гранта определяется по итогам конкурса, который
                  проводится исходя из наилучших условий достижения целей
                  (результатов) предоставления гранта.
                </p>
              </b-card-text>
            </b-tab>
            <b-tab title="Требования к заявителю">
              <b-card-text>
                <h3>Требования к заявителю</h3>
                <p>
                  Категория получателей гранта – юридические лица и
                  индивидуальные предприниматели, осуществляющие инновационную и
                  предпринимательскую деятельность (далее – Участники Конкурса).
                </p>
                <p>
                  Участники Конкурса на дату подачи заявки должны
                  соответствовать следующим требованиям:
                </p>
                <ul>
                  <li>
                    не должны находиться в процессе реорганизации (за
                    исключением реорганизации в форме присоединения к
                    юридическому лицу, являющемуся участником Конкурса, другого
                    юридического лица), ликвидации, в отношении них не введена
                    процедура банкротства, деятельность участника Конкурса не
                    приостановлена в порядке, предусмотренном законодательством
                    Российской Федерации (для юридических лиц);
                  </li>
                  <li>
                    не прекратили деятельность в качестве индивидуального
                    предпринимателя (для индивидуальных предпринимателей);
                  </li>
                  <li>
                    не должны являться иностранными юридическими лицами, а также
                    российскими юридическими лицами, в уставном (складочном)
                    капитале которых доля участия иностранных юридических лиц,
                    местом регистрации которых является государство или
                    территория, включенные в утвержденный Министерством финансов
                    Российской Федерации перечень государств и территорий,
                    предоставляющих льготный налоговый режим налогообложения и
                    (или) не предусматривающих раскрытия и предоставления
                    информации при проведении финансовых операций (офшорные
                    зоны), в совокупности превышает 50 процентов.
                  </li>
                </ul>
              </b-card-text>
            </b-tab>
            <b-tab
              title="Необходимые документы для предоставления меры поддержки"
            >
              <b-card-text>
                <h3>Необходимые документы для предоставления меры поддержки</h3>
                <p>
                  Участник Конкурса представляет главному распорядителю заявку,
                  которая включает следующие документы:
                </p>
                <ul>
                  <li>
                    заявление, содержащее согласие участника на публикацию
                    (размещение) в информационно-телекоммуникационной сети
                    "Интернет" информации об участнике, подаваемой участником
                    заявке и иной информации об участнике, связанной с отбором
                    участников на получение государственной поддержки;
                  </li>
                  <li>паспорт инновационного проекта;</li>
                  <li>
                    графические объекты (не менее 3), характеризующие суть
                    заявляемого инновационного проекта (фотографии, логотипы,
                    рисунки и другие);
                  </li>
                  <li>
                    согласие на обработку персональных данных (для
                    индивидуального предпринимателя).
                  </li>
                </ul>
              </b-card-text>
            </b-tab>
            <b-tab title="Порядок рассмотрения заявок участников">
              <b-card-text>
                <h3>Порядок рассмотрения заявок участников</h3>
                <p>Главный распорядитель выполняет следующие функции:</p>
                <ul>
                  <li>
                    осуществляет регистрацию заявок в день их поступления;
                  </li>
                  <li>
                    в течение 15 рабочих дней с момента окончания приема заявок:
                    определяет соответствие участников Конкурса требованиям
                    пунктов 1.6 и 2.2 положения;
                  </li>
                  <li>
                    рассматривает представленные заявки и документы в их составе
                    на предмет соблюдения требований, предусмотренных пунктами
                    2.4, 2.6, 2.7, 3.7 положения (в том числе проводит проверку
                    достоверности информации, содержащейся в указанных
                    документах);
                  </li>
                  <li>
                    по результатам рассмотрения заявок приказом принимает
                    решение о допуске или об отказе в допуске к участию в
                    Конкурсе по основаниям, указанным в пункте 2.9 положения;
                  </li>
                  <li>
                    в течение 2 месяцев со дня принятия решения о допуске к
                    участию в Конкурсе: организует работу Конкурсной комиссии по
                    рассмотрению заявок;
                  </li>
                  <li>
                    на основании итогового рейтинга, полученного в результате
                    рассмотрения заявок Конкурсной комиссией, приказом подводит
                    итоги Конкурса.
                  </li>
                </ul>
              </b-card-text>
            </b-tab>
            <b-tab title="Администратор меры">
              <b-card-text>
                <h3>Администратор меры</h3>
                <p>Территориальный уровень меры поддержки: Региональный</p>
                <p>
                  Название организации: Министерство экономического развития
                </p>
                <p>
                  Ссылка на сайт администратора меры поддержки:
                  <a href="https://dep.test.ru">https://dep.test.ru/</a>
                </p>
                <p>
                  Контактная информация: 200-00-00, e-mail:
                  <a href="mailto:test@test.ru">test@test.ru</a>
                </p>
              </b-card-text>
            </b-tab>
            <b-tab title="Нормативная правовая база">
              <b-card-text>
                <h3>Нормативно-правовая база</h3>
                <p>
                  Конкурс проводится в соответствии с положением о ежегодном
                  краевом конкурсе «Проекты технологической инициативы».
                </p>
              </b-card-text>
            </b-tab>
          </b-tabs>
        </b-card>
      </div>
    </div>
  </section>
</template>

<script>
export default {
  name: "SubsidyInfo",
};
</script>

<style lang="scss">
$gap: 1rem;
$basic-color: var(--primary);
$text-color: #212529;
$support-color: grey;
$passive-color: #e4e4e4;
$active-color: #fff;

.page-wrapper {
  min-height: 100vh;
  display: flex;
  flex-direction: column;

  .content {
    flex: 1;
  }
}

.support {
  padding-top: $gap/2;

  .support__header {
    .support__name {
      margin-bottom: $gap;
    }

    .support__details {
      & > * {
        margin-bottom: $gap;
      }

      @media (min-width: 768px) {
        display: flex;
        justify-content: space-between;
        align-items: center;
      }

      .support__date {
        color: $support-color;

        b {
          color: $text-color;
        }
      }
    }
  }

  hr {
    margin-top: 0;
  }

  .support__card {
    .support__card__header {
      display: flex;
      justify-content: space-between;

      & > * {
        margin-bottom: $gap;
      }

      .support__owner {
        .support__owner__header {
          color: $support-color;
        }

        .support__owner__logo {
          display: flex;
          font-weight: bolder;

          .org-logo {
            height: 38px;
            margin-right: $gap/2;
            margin-top: $gap/2;
          }
        }
      }

      .support__conditions {
        @media (min-width: 768px) {
          text-align: right;
        }

        .support__conditions__header {
          color: $support-color;
        }

        .support__size {
          font-size: 1.75rem;
          font-weight: 500;
        }

        .support__size__info {
          color: $support-color;
        }
      }

      .support__buttons {
        display: flex;
        align-items: start;

        @media (min-width: 768px) {
          justify-content: flex-end;
        }

        .support__icon {
          height: 38px;
          border: 1px solid $basic-color;
          border-radius: 0.25rem;
          margin-right: $gap/2;
        }
      }
    }

    hr {
      margin-top: 0;
    }

    .card {
      border: none;

      .nav {
        background-color: transparent;
        padding: 0;
        margin-bottom: $gap;

        @media (min-width: 768px) {
          padding-right: 1.25rem;
        }
      }

      .tab-content {
        margin-bottom: $gap;

        .tab-pane {
          padding: 0;

          @media (min-width: 768px) {
            padding-left: 1.25rem;
          }
        }

        ul {
          padding-left: 1.25rem;
        }

        :nth-last-child(1) {
          margin-bottom: 0;
        }
      }
    }
  }
}
</style>
